[
    {
        "title": "General: News and events",
        "description": "04 Feb 04/02/2026 Talk: Simon Saunders (Oxford) 05 Feb 05/02/2026 Talk (Work in Progress): Pablo Acuña (UC Chile) 05 Feb 05/02/2026 Talk: Timothy Williamson (Oxford)",
        "url": "https://www.philosophie.lmu.de/mcmp/en/index.html",
        "type": "general",
        "scraped_at": "2026-01-31T15:16:40.412221"
    },
    {
        "title": "General: About the MCMP",
        "description": "The Munich Center for Mathematical Philosophy (MCMP) at LMU Munich is one of the world's leading hubs for formal and mathematical approaches to philosophy. Founded in 2011, the MCMP brings together researchers who apply logical, probabilistic, statistical, and computational methods to a wide range of philosophical problems—from the foundations of logic, language, and mathematics to central questions in epistemology, philosophy of science, decision and social choice theory, and the philosophy of physics and artificial intelligence. Our aim is to demonstrate how mathematical methods can illuminate deep conceptual issues, yield precise analytical tools, and open up new perspectives across philosophy and neighboring fields. The MCMP also provides a lively and international environment for early-career researchers, with a vibrant calendar of talks, workshops, visitor programs, and a dedicated master's program in Logic and Philosophy of Science. Through our collaborative projects and global partnerships, we seek not only to advance rigorous philosophical research but also to engage with adjacent disciplines such as mathematics, physics, computer science, economics, and cognitive science. The MCMP thus stands as a unique institution dedicated to combining philosophical insight with mathematical precision.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/index.html",
        "type": "general",
        "scraped_at": "2026-01-31T15:16:40.412271"
    },
    {
        "title": "General: Insitutional setting",
        "description": "The MCMP mainly consists of the following three Chairs based at the Faculty of Philosophy, Philosophy of Science and Religious Studies at the LMU München.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/index.html",
        "type": "general",
        "scraped_at": "2026-01-31T15:16:40.412304"
    },
    {
        "title": "General: Insitutional setting",
        "description": "The MCMP mainly consists of the following three Chairs based at the Faculty of Philosophy, Philosophy of Science and Religious Studies at the LMU München.\nChair of Philosophy of Science Prof. Dr. Stephan Hartmann Read more Chair of Logic and Philosophy of Language Prof. DDr. Hannes Leitgeb Read more Chair of Philosophy and Decision Theory Prof. Dr. Christian List Read more",
        "url": "https://www.philosophie.lmu.de/mcmp/en/index.html",
        "type": "general",
        "scraped_at": "2026-01-31T15:16:40.412361"
    },
    {
        "title": "General: Our history",
        "description": "The MCMP was founded by Hannes Leitgeb in October 2010. Its initial team arrived by April 2011, and the MCMP was in full operation by May 2011. In October 2012 Stephan Hartmann moved to LMU Munich and joined directorship of the MCMP with Hannes Leitgeb. Both Hannes Leitgeb and Stephan Hartmann have been awarded Alexander von Humboldt Professorships by the Alexander von Humboldt Foundation , and they are using these funds (and funds from LMU) in order to build up the MCMP.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/index.html",
        "type": "general",
        "scraped_at": "2026-01-31T15:16:40.412394"
    },
    {
        "title": "General: About Mathematical Philosophy",
        "description": "Mathematical philosophy refers to the application of mathematical methods to philosophical questions. It is a booming field which intersects with many traditional areas of philosophy: mathematical methods are now being used not only in epistemology, the philosophy of language, the philosophy of science, and the philosophy of mathematics, but also in ethics, political philosophy, and even in the philosophy of religion. The mathematical methods used to tackle problems and questions from these (and other) fields range from various logics and probability theory to modeling and simulation methods that are imported from the natural and social sciences. Indeed, much of the work done at the MCMP can be characterized as approaching philosophical problems and questions in exactly the same way scientists approach their problems.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/index.html",
        "type": "general",
        "scraped_at": "2026-01-31T15:16:40.412424"
    },
    {
        "title": "General: Principal aims",
        "description": "Our principal aims are: To produce and disseminate original research of excellence that results from the application of mathematical methods within any area of philosophy and which gets published in international peer-reviewed journals or monographs. To support promising early career philosophers, as well as scientists who intend to turn to philosophy, to develop their interests and skills and to absorb examples of best research practice in collaboration with experts at the MCMP and at the Faculty of Philosophy, Philosophy of Science and Religious Studies at LMU Munich. To stimulate and coordinate work on mathematical philosophy worldwide through the invitation of visiting scholars, international networks, colloquia, conferences, and virtual collaboration and dissemination. To develop standing research liaisons with selected institutions of philosophical excellence worldwide. To foster collaboration with researchers from adjacent areas, such as cognitive science, computer science, economics, mathematics, neurosciences, statistics, and physics, whether internationally, within Germany, or locally in Munich. To communicate a sense of the goals, results, and interests of our research to a non-professional audience.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/index.html",
        "type": "general",
        "scraped_at": "2026-01-31T15:16:40.412460"
    }
]