[
    {
        "name": "Zhouwanyue (Nata) Yang, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/zhouwanyue-nata-yang-d67e863e.html",
        "description": "PhD project Title: Pluralism in Mathematical Understanding Kant's philosophy of mathematics can be viewed as an application of his epistemology to the realm of mathematics, to the effect that the mathematical understanding is justified by the use of cognitive faculties. Due to the indispensable role of Sinnlichkeit (sensitivity) within Kant's framework, his philosophy of mathematical understanding is fundamentally challenged by modern advancements in mathematics, which have evolved without leaning on sensory intuition. Recognizing this, this project seeks to formulate a new systematic account of how cognitive faculties (which correspond to Kantian \"cognitive faculties\") justify mathematical theorizing. The account modifies the Kantian strategy of attributing the justification of mathematical understanding to our cognitive faculties while embracing the paradigm(s) of modern mathematics. To achieve this objective, the project focuses on mathematical agents, individuals equipped with cognitive faculties, who enhance their understanding through inquiry processes. Through the examination of concrete cases from mathematical practice, the understanding of a mathematical agent will be argued to be characterized by: 1) her use of cognitive faculties that justify her actions performed in her processes of inquiry, and 2) the objects on which she performs these actions to form an understanding of her subject of interest. These three concepts — cognitive faculties, actions, and objects — serve the dual purpose of identifying mathematical understanding and differentiating amongst different kinds of understanding. Rooted in this analysis, the project probes the normative principles for the constitution of mathematical understanding. Given the centrality of actions within the present process-based framework, the normativity of mathematical understanding will be defined by drawing from Sosa's normative theory of performance, as exemplified by his work on virtue epistemology. This will allow comparison of different kinds of mathematical understanding across different kinds of mathematical agents. On this basis, the project's epistemological stance will be illuminated through Carnap's pluralistic stance on mathematical languages. Ultimately, this will lead the project to advocate a pluralistic conception of the constitution of mathematical understanding.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "Yangzhwy@outlook.com",
            "office_address": "Ludwigstraße 31",
            "room": "Room 225"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.895429"
    },
    {
        "name": "Dr. Dominik Ehrenfels",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/dominik-ehrenfels-1f46f551.html",
        "description": "Personal information I am a postdoctoral associate on the DFG funded research project The Effective World , run by Sébastien Rivat. Before that, I completed the BPhil and DPhil in Philosophy at Oxford, and bachelor’s degrees in physics and philosophy at the LMU.\n\nResearch interests My interests lie primarily in the philosophy of science and the philosophy of physics. For the DFG project on effective theories, my plan is to focus on issues of emergence and the autonomy of higher-level theories. My DPhil Thesis is concerned with the role of symmetries in the interpretation of theories, and specifically with the way reformulation can help us eliminate symmetry-variant structure. Related to this, I am particularly interested in Julian Barbour’s relationalism and shape dynamics. Besides that, I have secondary interests in the philosophy of logic (esp. logical conventionalism) and metaphysics (esp. material plenitude).",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/dominik_ehrenfels_1_1_format_s.jpg",
            "email": "D.Ehrenfels@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 124",
            "website": "https://www.dominikehrenfels.com ",
            "research_interests_text": "My interests lie primarily in the philosophy of science and the philosophy of physics. For the DFG project on effective theories, my plan is to focus on issues of emergence and the autonomy of higher-level theories. My DPhil Thesis is concerned with the role of symmetries in the interpretation of theories, and specifically with the way reformulation can help us eliminate symmetry-variant structure. Related to this, I am particularly interested in Julian Barbour’s relationalism and shape dynamics. Besides that, I have secondary interests in the philosophy of logic (esp. logical conventionalism) and metaphysics (esp. material plenitude)."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.488886"
    },
    {
        "name": "Elio La Rosa, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/elio-la-rosa-7064b5ca.html",
        "description": "Personal information I am a doctoral fellow at the MCMP under the supervision of Prof. DDr. Hannes Leitgeb and Dr. Norbert Gratzl. I obtained my M.A. in Logic and Philosophy of Science in 2019 at the MCMP.\n\nComplete CV (PDF, 150 KB)\n\nResearch interests My research focuses on various aspects of logic. During my M.A., I specialised in proof-theoretic approaches for defining non-classical logics. In particular, I worked on the hyperintensional logics N4 and HYPE. These logics capture inferences in particularly refined contexts, and are useful e.g. to model a fine-grained notion of content. In the meanwhile, I started working on Strict-Tolerant logics, substructural logics that aim at avoiding semantic paradoxes while maintaining classical validities. The mere fact that such logics can be defined has repercussions for our conception of logic itself, and stresses its reliance on some properties of the consequence relation. I am now investigating both topics at a first-order level. This requires a ‘free’ approach to quantification, i.e. one that does not presuppose a denotation for all terms in every context. Later, I got interested in non-deterministic semantics applied to modal logics. This approach generalises truth-tables to output sets of values, and seems powerful enough to provide a common framework for normal and non-normal modal logics. This offers a different approach to intensionality than world-based semantics as well as a way to characterise phenomena of indeterminacy in logic. The latter is part of a larger project of mine aimed at capturing various aspects of indeterminacy and constitutes the main topic of my PhD research. Building on Carnap’s explicit definition of theoretical terms in science, I am working on a general way to denote contexts with the use of Epsilon Calculus. These structures seem to share some underlying properties of non-deterministic semantics, as well as offering new ways to define hyperintensional contexts in classical-based logics.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "E.Rosa@lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "selected_publications": [
                "De Benedetto, M. & La Rosa, E. (2024). Patches, Patchworks, and Epsilon Terms: A Neo-Carnapian Account of Theoretical Terms in Science. Journal of Philosophical Logic. https://doi.org/10.1007/s10992-024-09774-3.",
                "Pawlowski, P., & La Rosa, E. (2022). Modular non-deterministic semantics for T, TB, S4, S5 and more. Journal of Logic and Computation, 32(1), 158-171.",
                "Cobreros, P., La Rosa, E., & Tranchini, L. (2021). Higher-level inferences in the strong-Kleene setting: A proof-theoretic approach. Journal of Philosophical Logic, 51, 1417–1452.",
                "Cobreros, P., La Rosa, E., & Tranchini, L. (2021). (I can’t get no) antisatisfaction. Synthese, 198(9), 8251-8265."
            ],
            "research_interests_text": "My research focuses on various aspects of logic. During my M.A., I specialised in proof-theoretic approaches for defining non-classical logics. In particular, I worked on the hyperintensional logics N4 and HYPE. These logics capture inferences in particularly refined contexts, and are useful e.g. to model a fine-grained notion of content. In the meanwhile, I started working on Strict-Tolerant logics, substructural logics that aim at avoiding semantic paradoxes while maintaining classical validities. The mere fact that such logics can be defined has repercussions for our conception of logic itself, and stresses its reliance on some properties of the consequence relation. I am now investigating both topics at a first-order level. This requires a ‘free’ approach to quantification, i.e. one that does not presuppose a denotation for all terms in every context. Later, I got interested in non-deterministic semantics applied to modal logics. This approach generalises truth-tables to output sets of values, and seems powerful enough to provide a common framework for normal and non-normal modal logics. This offers a different approach to intensionality than world-based semantics as well as a way to characterise phenomena of indeterminacy in logic. The latter is part of a larger project of mine aimed at capturing various aspects of indeterminacy and constitutes the main topic of my PhD research. Building on Carnap’s explicit definition of theoretical terms in science, I am working on a general way to denote contexts with the use of Epsilon Calculus. These structures seem to share some underlying properties of non-deterministic semantics, as well as offering new ways to define hyperintensional contexts in classical-based logics."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.147229"
    },
    {
        "name": "Marina Moreno",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/marina-moreno-b65168fe.html",
        "description": "Personal information Marina Moreno is a doctoral fellow at the MCMP, supervised by Prof. Christian List and Prof. Johanna Thoma (Bayreuth), the latter as an external secondary supervisor. She obtained her BA in Philosophy, Computer Science, and Economic Sciences from the University of Bern in 2020, and successfully completed the MA program in Logic and Philosophy of Science at the MCMP in 2022. Moreover, she is interested in ethics and policy research, for instance through her role as Research Fellow at the Solon Center for Policy Innovation from 2020 to 2023.\n\nResearch interests Generally, Marina Moreno's core interests are in formal practical philosophy, including decision theory, rationality theory, game theory and social choice theory. Her doctoral project investigates the concept of well-being and its relationship to rational reasons for action. In particular, she is investigating how an individual can be understood as an intrapersonal collective, both synchronically, as a collective of conflicting internal wishes, and diachronically, as a collective of different person-stages over time. To this end, she uses various tools from traditionally interpersonal fields such as social choice theory or population ethics, in order to understand the intrapersonal domain. Marina Moreno is also interested in the philosophy of suffering, metaethics (especially subjectivism and pluralism), political philosophy and social epistemology.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/moreno-marina-foto_1_1_format_s.jpg",
            "email": "M.Moreno@campus.lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "selected_publications": [
                "Lambrecht, F. & Moreno, M. (forthcoming). What is AI Ethics? American Philosophical Quarterly .",
                "Moreno, M. (2022). Does longtermism depend on questionable forms of aggregation? Intergenerational Justice Review 8 (1):13-23.",
                "Moreno, M. & Mannino, A. (2022). Produktiv streiten über “Produktives Streiten”: Diskursoptimierung, Moralisierung und Cancel Culture. Skeptiker (1), 16-21.",
                "Mannino, A. & Moreno, M. (eds.) (2022). Peter Singer: Alle Tiere sind gleich (Übersetzung und Kommentar: Alle Tiere sind gleich – nur manche gleicher? Zur Plausibilität einer unitaristischen Ethik). Stuttgart: Reclam."
            ],
            "research_interests_text": "Generally, Marina Moreno's core interests are in formal practical philosophy, including decision theory, rationality theory, game theory and social choice theory. Her doctoral project investigates the concept of well-being and its relationship to rational reasons for action. In particular, she is investigating how an individual can be understood as an intrapersonal collective, both synchronically, as a collective of conflicting internal wishes, and diachronically, as a collective of different person-stages over time. To this end, she uses various tools from traditionally interpersonal fields such as social choice theory or population ethics, in order to understand the intrapersonal domain. Marina Moreno is also interested in the philosophy of suffering, metaethics (especially subjectivism and pluralism), political philosophy and social epistemology."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.622959"
    },
    {
        "name": "Dr. Martin King",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/martin-king-f71af375.html",
        "description": "Personal information Martin King is a postdoctoral fellow at the Munich Center for Mathematical Philosophy where he has been working on his DFG individual grant project \"Deep Learning in Particle Physics: A Philosophical Analysis\" since October 2022. Prior to that, he was Postdoctoral Researcher for the DFG-funded research unit \"Epistemology of the LHC\" at the Physics Institutes at the University of Bonn and at the University of Wuppertal from 2016 to 2022. He received his PhD in Philosophy at the University of Guelph in Canada in 2016. Martin is also a member of the Lichtenberg Group for the History and Philosophy of Physics at the University of Bonn.\n\nFull CV (PDF, 123 KB)\n\nResearch interests Martin's research interests are in philosophy of science, the philosophy of physics, and the philosophy of artificial intelligence. In publications, he has contributed to debates on scientific explanation, confirmation, and modelling as they pertain to physics, and in particular, particle physics. He is currently working on the epistemological issues surrounding the use of artificial intelligence (in particular deep learning), the change in scientific methodology, and the transformation and treatment of huge amounts of data in searches for new physics.",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/king-martin_1_1_format_s.jpg",
            "email": "Martin.King@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 125",
            "website": "http://www.philphys.com/",
            "selected_publications": [
                "Doing More with Less: Dark Matter & Modified Gravity (2023) in: Mills Boyd, N., De Baerdemaeker, S., Heng, K., Matarese, V. (eds) Philosophy of Astrophysics Synthese Library , Vol. 472. pp. 91–107, DOI: 10.1007/978-3-031-26618-8-6",
                "Introduction: Simplicity out of complexity?: physics and the aims of science, (2023) Synthese Topical Collection vol. 199, with F. Boge, P. Gruenke, and M. A. Carratero Sahuquiho.",
                "Universality is not Universal: how much can we explain with falsehoods? (2022) Metascience .",
                "Bottoms Up: The Standard Model Effective Field Theory from a Model Perspective (2022) Studies in History and Philosophy of Science 92, pp. 129–143, with P. Bechtle, C. Chall, M. Kraemer, P. Maettig, and M. Stoeltzner.",
                "Conjectures and Disconfirmations: Confirming the Standard Model Higgs (2021) Erkenntnis , DOI: 10.1007/s10670-021-00473-y",
                "Explanations and candidate explanations in physics (2020) European Journal for Philosophy of Science , 10(1) pp. 1–17.",
                "From a Boson to the Standard Model Higgs: a Case Study in Confirmation and Model Dynamics (2018) Synthese SI: Reasoning in Physics , pp. 1–33, with C. Chall, P. Maettig, and M. Stoeltzner.",
                "On structural accounts of model-explanations (2016) Synthese , 193(9) pp. 2761–2778."
            ],
            "research_interests_text": "Martin's research interests are in philosophy of science, the philosophy of physics, and the philosophy of artificial intelligence. In publications, he has contributed to debates on scientific explanation, confirmation, and modelling as they pertain to physics, and in particular, particle physics. He is currently working on the epistemological issues surrounding the use of artificial intelligence (in particular deep learning), the change in scientific methodology, and the transformation and treatment of huge amounts of data in searches for new physics."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.511256"
    },
    {
        "name": "Hosea von Hauff, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/hosea-von-hauff-e1f45fee.html",
        "description": "PhD project My PhD project is in formal epistemology. I am interested in how beliefs are modeled. Traditionally, the contents of beliefs are simply modeled as propositions, which solves but also causes a whole lot of problems. New developments suggest that beliefs are more suitably represented as something more fine-grained, which can be thought of as a proposition in a specific context, which makes belief (of a proposition) relative to a context. Another way to look at it is as belief being an \"answer to a question,\" e.g., the \"question under discussion\". Yet another way to think of these contexts is as \"subject matters\". Such a modeling of belief raises the question of how beliefs relate across changes in context/subject matter/question under discussion. My research focuses on developing an epistemic logic to express belief relative to these contexts and how beliefs change as the context shifts. This line of research sheds light on an underexplored dynamical dimension of belief systems. Key references include \"Aboutness\" by Stephen Yablo and \"The Stability Theory of Belief\" by Hannes Leitgeb.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "Hosea.Hauff@campus.lmu.de",
            "office_address": "Ludwigstraße 31"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.786656"
    },
    {
        "name": "Wouter Cohen",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/wouter-cohen-2d7cb4ea.html",
        "description": "Personal information I have been an Alexander von Humboldt Research Fellow at the MCMP since November 2024. Before coming to the MCMP, I was a postdoctoral researcher at the University of Manchester with an Analysis Studentship. I completed my PhD in Philosophy at the University of Cambridge in September 2023, where I also received an MPhil. I also did the Logic Year at the ILLC (University of Amsterdam) and have BA degrees in Philosophy and Musicology from Utrecht University.\n\nResearch interests My research interests are relatively diffuse. I am currently working on (i) the development and historical roots of Russell's theory of existence, (ii) Carnapian approaches to neo-logicism and inferentialism, (iii) an empiricist framework for modality with a new semantics for first-order modal logic. I am also actively interested in the philosophical significance of James Baldwin's work and writing a paper on Baldwin and forgiveness.\n\nPublications Cohen, W.A. Forthcoming. \"Carnapian neo-Fregeanism and the bad company objection\". Australasian Journal of Philosophy . Cohen, W.A. 2024. \"The audibility problem and indirect listening\". Australasian Journal of Philosophy 102: 147-158. Cohen, W.A. and B. Marschall. 2023. \"Would Carnap have tolerated modern metaphysics?\". The Monist 106: 325-41. Cohen. W.A. 2022. \"Denoting concepts and ontology in Russell's Principles of Mathematics \". Journal for the History of Analytic Philosophy 10(7): 1-22.",
        "metadata": {
            "position": "Postdoctoral fellow",
            "organizational_unit": "MCMP",
            "email": "Wouter.Cohen@lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 221",
            "website": "https://wacohen.nl/",
            "research_interests_text": "My research interests are relatively diffuse. I am currently working on (i) the development and historical roots of Russell's theory of existence, (ii) Carnapian approaches to neo-logicism and inferentialism, (iii) an empiricist framework for modality with a new semantics for first-order modal logic. I am also actively interested in the philosophical significance of James Baldwin's work and writing a paper on Baldwin and forgiveness."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.195540"
    },
    {
        "name": "Rafael Fuchs",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/rafael-fuchs-11c3c2e0.html",
        "description": "PhD project My PhD project focuses on reasoning and argumentation in science and collective decision making. To that end, I use formal modeling tools from Bayesian epistemology, decision theory, and information theory. Furthermore, as my project is part of the Graduate School of Systemic Neurosciences, I am interested in relating these formal models to empirical insights from neuroscience and psychology to understand how they relate to descriptive facts about human reasoning.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP, GSN",
            "email": "Rafael.Fuchs@campus.lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.274999"
    },
    {
        "name": "Dr. Gabriel Târziu",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/gabriel-tarziu-17a5958c.html",
        "description": "Personal information Gabriel Târziu is a Marie Skłodowska-Curie Postdoctoral Fellow at the Munich Center for Mathematical Philosophy. Before joining the MCMP in November 2022, he worked as a postdoctoral researcher for the Romanian Academy and he spent time in Munich, Brussels, Essen and Ghent as a research fellow.\n\nFull CV (PDF, 549 KB)\n\nResearch interests Gabriel specializes in epistemology, the philosophy of science, and the philosophy of mathematics and he has a wide interest in topics related to (scientific) understanding and explanation, the problem of the applicability of mathematics to the physical world, and the ontological debate in the philosophy of mathematics. Currently, he works on an MSCA-funded project on the epistemological particularities of understanding in climate science. His aim in this project is to develop an account of climate scientific understanding that takes climate model hierarchies as central for achieving understanding in climate science.",
        "metadata": {
            "position": "Teaching Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/tarziu-gabriel_1_1_format_s.jpg",
            "email": "Gabriel.Tarziu@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 129",
            "website": "https://sites.google.com/site/gabrieltarziu",
            "selected_publications": [
                "Tȃrziu, G.: Can We Have Physical Understanding of Mathematical Facts? Acta Analytica 37(2): 135-158 (2022).",
                "Târziu, G.: How Do We Obtain Understanding with the Help of Explanations? Axiomathes 31(2): 173-197 (2021).",
                "Târziu, G.: Importance and Explanatory Relevance: The Case of Mathematical Explanations. Journal for General Philosophy of Science 49(3): 393-412 (2018).",
                "Târziu, G.: Can we have mathematical understanding of physical phenomena? Theoria: An International Journal for Theory, History and Foundations of Science 33(1): 91-109 (2018).",
                "Târziu, G.: Mathematical Explanations and the Piecemeal Approach to Thinking about Explanation. Logique et Analyse 61(244): 457-487 (2018)."
            ],
            "research_interests_text": "Gabriel specializes in epistemology, the philosophy of science, and the philosophy of mathematics and he has a wide interest in topics related to (scientific) understanding and explanation, the problem of the applicability of mathematics to the physical world, and the ontological debate in the philosophy of mathematics. Currently, he works on an MSCA-funded project on the epistemological particularities of understanding in climate science. His aim in this project is to develop an account of climate scientific understanding that takes climate model hierarchies as central for achieving understanding in climate science."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.786376"
    },
    {
        "name": "Dr. Idit Chikurel",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/idit-chikurel-bbac3a13.html",
        "description": "Personal information Idit Chikurel is a postdoctoral fellow funded by the Minerva Stiftung. She obtained a PhD in Philosophy of Science (2019), an M.A. in the History and Philosophy of Science and Ideas (2011) and a B.A. in Psychology and Women's and Gender Studies (2005), all at Tel Aviv University. She has conducted several postdoctoral projects at the University of Hamburg, University of Potsdam, Max Planck Institute of Science, Humboldt University and ETH Zurich. She was recently a visiting lecturer at Berlin Institute of Technology and the University of Potsdam, and formerly an exchange graduate student at Paris-Sorbonne – Paris IV University.\n\nResearch interests Idit's research interests are in the philosophy and history of science, especially of mathematics, as well as in the history of philosophy. She is focused on epistemological and metaphysical questions, namely on the use of mathematical knowledge in the construction of philosophical arguments. Currently she is interested in conceptions of ampliative analysis and the role of mathematics in the formation of these conceptions, as well as in their connection to theories of grounding and of consequences.",
        "metadata": {
            "position": "Teaching Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "email": "Idit.Chikurel@lrz.uni-muenchen.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "selected_publications": [
                "Chikurel, I. Salomon Maimon's Theory of Invention: Scientific Genius, Analysis and Euclidean Geometry . Berlin/Boston: Walter de Gruyter (2020)",
                "Chikurel, I. Maimon as a Baconian: Natural Histories, Induction, and the Ladder of Certainty. Inquiry: An Interdisciplinary Journal of Philosophy (published online 2024/forthcoming in print).",
                "Chikurel, I. Scepticism and Certainty in Maimon's Theory of Invention. Maimonides Review of Philosophy and Religion 3 (forthcoming)",
                "Chikurel, I. Analysis and Necessity in Arithmetic in Light of Maimon's Concept of Number as Ratio. Kant-Studien 114 (1): 33-67 (2023).",
                "Chikurel I. Ma’aseh Choshev. In: Reihe II: Hebräische Schriften, Band I: 1778, Maimon Gesamtausgabe, Yitzhak Y. Melamed (Ed.), Stuttgart-Bad Cannstatt: Frommann-Holzboog Verlag (in progress)."
            ],
            "research_interests_text": "Idit's research interests are in the philosophy and history of science, especially of mathematics, as well as in the history of philosophy. She is focused on epistemological and metaphysical questions, namely on the use of mathematical knowledge in the construction of philosophical arguments. Currently she is interested in conceptions of ampliative analysis and the role of mathematics in the formation of these conceptions, as well as in their connection to theories of grounding and of consequences."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.616823"
    },
    {
        "name": "Dr. Borut Trpin",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/borut-trpin-53212be5.html",
        "description": "",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "website": "https://boruttrpin.weebly.com/"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.284156"
    },
    {
        "name": "Dr. Sébastien Rivat",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/sebastien-rivat-d5737a8b.html",
        "description": "Personal information Sébastien Rivat joined the MCMP in 2022 after spending two years (2020-2022) as a postdoctoral fellow at the Max Planck Institute for the History of Science in Berlin. He received his PhD in Philosophy from Columbia University in 2020, where he also taught in the Core Curriculum. Before coming to Columbia, he completed a MPhil in History and Philosophy of Science and a Master's degree in Theoretical Physics (Part III of the Mathematical Tripos) at the University of Cambridge, and he did his undergraduate studies at École Centrale Paris.\n\nFull CV (PDF, 361 KB)\n\nResearch interests Sébastien's main research focus is on the history and philosophy of physics. He explores how recent developments at the frontiers of physics, especially in the quantum realm, affect our understanding of why science works so well. He has looked primarily at the framework of effective theories up until now, moving more recently towards history to trace their origins and gain further conceptual insights. Along the way, he has been led to develop new projects in the foundations of physics (e.g., the status of gauge symmetries, the concept of open system, the epistemology of discretization methods). His other research interests include metaphysics and early modern philosophy.",
        "metadata": {
            "position": "ERC Group Leader",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/rivat_1_1_format_s.jpg",
            "email": "Sebastien.Rivat@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 124",
            "website": "https://www.sebastienrivat.com/",
            "selected_publications": [
                "Rivat, S.: \"Still No Peace on the Lattice\", Philosophy of Physics (forthcoming).",
                "Rivat, S.: \"How Theoretical Terms Effectively Refer\", Synthes e 205: 154 (2025).",
                "Rivat, S.: \"The Genesis of the Wilsonian Renormalization Group\" (in French), Revue d'Histoire des sciences 78(1): 169-201 (2025).",
                "Rivat, S.: Open Systems Across Scales. Synthese 205: 11 (2025).",
                "Rivat, S.: Wait, Why Gauge?. The British Journal for the Philosophy of Science , published online (2023).",
                "Rivat, S.: Drawing Scales Apart: The Origins of Wilson's Conception of Effective Field Theories. Studies in History and Philosophy of Science 90: 321-338 (2021).",
                "Rivat, S.: Effective Theories and Infinite Idealizations: A Challenge for Scientific Realism. Synthese 198: 12107–12136 (2021).",
                "Rivat, S., & Grinbaum A.: Philosophical Foundations of Effective Field Theories. The European Physical Journal A 56: 90 (2020).",
                "Rivat, S.: Renormalization Scrutinized. Studies in History and Philosophy of Modern Physics 68C: 23-39 (2019)."
            ],
            "research_interests_text": "Sébastien's main research focus is on the history and philosophy of physics. He explores how recent developments at the frontiers of physics, especially in the quantum realm, affect our understanding of why science works so well. He has looked primarily at the framework of effective theories up until now, moving more recently towards history to trace their origins and gain further conceptual insights. Along the way, he has been led to develop new projects in the foundations of physics (e.g., the status of gauge symmetries, the concept of open system, the epistemology of discretization methods). His other research interests include metaphysics and early modern philosophy."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.679842"
    },
    {
        "name": "Dr. Silvia Milano",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/silvia-milano-bf48bf14.html",
        "description": "Personal information Silvia is a Humboldt Fellow at the MCMP and a Senior Lecturer in Philosophy at the University of Exeter (UK). Her research interests are in epistemology and ethics of AI. Her recent work has focused on AI and epistemic injustice, the ethical challenges of recommender systems, polarization on social networks, and the impacts of LLMs on education. She is currently developing a philosophical analysis of recommender systems, encompassing their social, epistemological, and ethical dimensions. Silvia was previously Golding Junior Research Fellow at Brasenose College and Research Fellow in Philosophy of AI at the Future of Humanity Institute, University of Oxford (2020-2022), and Postdoctoral Researcher at the Oxford Internet Institute (2018-2020). She obtained a PhD in Philosophy from the London School of Economics and Political Science under the supervision of Prof. Christian List and Prof. Anna Mahtani, with a thesis on the epistemology of de se beliefs. Before this, she completed an MA and BA in Philosophy at the University of Pisa and Scuola Normale Superiore of Pisa, Italy. For more information on Silvia's research and publications, see her personal website .",
        "metadata": {
            "position": "Humboldt Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "email": "S.Milano@exeter.ac.uk",
            "office_address": "Ludwigstraße 31",
            "room": "Room 126",
            "website": "https://www.silvia-milano.com/"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.062428"
    },
    {
        "name": "Dr. Michael Cuffaro",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/michael-cuffaro-ee88f935.html",
        "description": "Personal information My research interests are mainly in the philosophy of science and in the history of philosophy of science. I'm particularly interested in issues having to do with the relation between physics and computation. With Michael Janas and Michel Janssen, I am the co-author of Understanding Quantum Raffles: Quantum Mechanics on an Informational Approach — Structure and Interpretation . I'm the co-editor, with Sam Fletcher, of the edited volume, Physical Perspectives on Computation, Computational Perspectives on Physics , and the co-author, with Amit Hagar, of the Stanford Encyclopedia of Philosophy entry on Quantum Computation . Aside from this I have published on the topic of scientific explanation, on Kant, on Hobbes, on Frege, and in the areas of legal and political philosophy. I have published in The British Journal for the Philosophy of Science, Philosophy of Science, Studies in History and Philosophy of Modern Physics, History of Philosophy Quarterly, Politics Philosophy and Economics, and other journals. I received my Bachelor's degree in Computer Science, and then my Master's degree in Philosophy, from Concordia University in Montreal, Quebec. I received my Ph.D. in Philosophy from the University of Western Ontario in London, Ontario. I completed postdocs at LMU Munich's Munich Center for Mathematical Philosophy and at the University of Western Ontario's Rotman Institute of Philosophy , and have been a Senior Visiting Fellow of the Descartes Centre at the University of Utrecht. For a summary of my current research projects, pre/post-prints of my papers, upcoming talks, etc., see my personal website ( www.michaelcuffaro.com ).",
        "metadata": {
            "position": "Visiting researcher",
            "organizational_unit": "MCMP",
            "email": "Mike@michaelcuffaro.com",
            "website": "http://www.michaelcuffaro.com/"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.135615"
    },
    {
        "name": "Prof. Dr. Stephan Hartmann",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/stephan-hartmann-6dff5dee.html",
        "description": "Personal information Stephan Hartmann is Chair of Philosophy of Science, Co-director of the Munich Center for Mathematical Philosophy, and Dean of the Faculty of Philosophy, Philosophy of Science and Religious Studies at LMU. Moreover, he is an external member of the Faculty of Psychology and Educational Sciences. He researches and teaches on questions in general philosophy of science, philosophy of physics, formal epistemology and formal philosophy of science, social epistemology, and (Bayesian) cognitive science. His current research interests include the philosophy of open quantum systems, the philosophy and psychology of reasoning and argumentation, and models of deliberation.\n\nCurriculum vitae 2023 - Dean of the Faculty of Philosophy, Philosophy of Science and Religious Studies, LMU Munich 2023 - External member of the Department of Psychology, LMU Munich 2012 - Chair of Philosophy of Science and Co-director of the Munich Center for Mathematical Philosophy (MCMP), LMU Munich 2012 - Associate member, Arnold Sommerfeld Center for Theoretical Physics, LMU Munich 2012 - Member, Munich Center for Neurosciences, LMU Munich 2012 - Member, Center for Advanced Studies, LMU Munich 2010 - 2011 Visiting Professor, Department of Philosophy, Lund University, Sweden 2007 - 2012 Professor of Philosophy of Science and Epistemology and Founding Director of the Tilburg Center for Logic and Philosophy of Science (TILPS), Tilburg University, Netherlands 2003 - 2007 Teaching posts at the Department of Logic, Methodology and Philosophy of Science, London School of Economics, UK (2006-07: Professor, 2005-06: Reader, 2003-05: Lecturer) 2006 Visiting Professor, Department of Logic and Philosophy of Science, UC Irvine, USA 2004 - 2006 Director, Centre for Philosophy of Natural and Social Sciences (CPNSS), London School of Economics, UK 2000 - 2001 Visiting Fellow, Center for Philosophy of Science, University of Pittsburgh, USA 1998 - 2003 Assistant Professor in the subject of Philosophy, University of Konstanz 1995 PhD in Philosophy, University of Gießen 1987 - 1991 Studied Physics and Philosophy at the University of Gießen, earning an MSc (Physics) and MA (Philosophy) View all\n\nFull CV (PDF, 384 KB)\n\nComplete list of publications (PDF, 102 KB) Publications on Open Access LMU\n\nAcademic distinctions 2023 Corresponding Member, Académie Internationale de Philosophie des Sciences 2021 - 2024 Henriette Herz Scout, Alexander von Humboldt Foundation 2020 Member, Foundational Questions Institute (FQXi) 2019 Member, Bavarian Academy of Sciences and Humanities 2016 Member, Leopoldina 2012 Alexander von Humboldt Professorship 2008 - Honorary Visiting Professor, Sydney Centre for the Foundations of Science, University of Sydney, Australia\n\nResearch projects Current externally funded research projects Argumentation in a Social Context, funded by the DFG (2024 - 2027) Amalgamating Evidence About Causes: Medicine, the Medical Sciences, and Beyond , funded by the Arts and Humanities Research Council (AHRC, UK) and the DFG (“UK-German Collaborative Research Project in the Arts and Humanities”; with Jacob Stegenga, Cambridge) (2023 - 2026) Completed externally funded research projects (selection) Towards a Mathematical Philosophy of Consciousness, funded by the LMU-NYU Strategic Partnership (with Johannes Kleiner) (2023 - 2024) Decision Theory and the Future of Artificial Intelligence , funded by the Cambridge-LMU Strategic Partnership (with Jacob Stegenga) (2022 - 2024) The Universe as an Open System , funded by the Arts and Humanities Research Council (AHRC, UK) and the DFG (“UK-German Collaborative Research Project in the Arts and Humanities”, with Karim Thebault, James Ladyman and David Sloan, Bristol) (2021 - 2024) The Bayesian Approach to Robust Argumentation Machines , funded as part of the DFG priority programme “Robust Argumentation Machines” (2021 - 2024)\n\nTeaching Prof. Hartmann's current courses can be found on LSF . If you wish to write a thesis under Prof. Hartmann's supervision, please contact him by email, including a few sentences outlining the planned topic, in order to arrange an appointment.\n\nFurther activities 2024 - 2028 Member of the Research Committee, Bavarian Academy of Sciences and Humanities 2023 - Member, Advisory Board, Open Science Center, LMU Munich 2023 Panel member, Fundacao para a Ciencia e a Tecnologia (FCT), Portugal 2023 Panel member, National Science Center of Poland (NCN) 2021 - Panel member, Research Council of Norway (RCN) 2018 - Member, ESF College of Expert Reviewers 2015 Panel member, European Research Council (ERC) 2014 - Member, International Advisory Board, Berlin School of Mind and Brain 2014 - 2017 President, European Society for Analytical Philosophy (ESAP) 2013 - 2017 President, European Philosophy of Science Association (EPSA) 2012 - 2016 Scientific Board Member, Munich Center for Neurosciences, LMU Munich 2011 - 2012 Member, Wetenschappelijke Adviescollege Geesteswetenschappen (",
        "metadata": {
            "position": "Chair, Co-director of the MCMP",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/hartmann-high_1_1_format_s.jpg",
            "email": "S.Hartmann@lmu.de",
            "phone": "+49 89 2180-3320",
            "office_address": "Ludwigstraße 31",
            "room": "Room 134",
            "website": "http://www.stephanhartmann.org/",
            "selected_publications": [
                "Sprenger, J. & Hartmann, S.: Bayesian Philosophy of Science . Oxford: Oxford University Press, 2019.",
                "Eva, B. & Hartmann, S.: Bayesian Argumentation and the Value of Logical Validity . Psychological Review 125 (5): 806–821 (2018).",
                "Stern, R. & Hartmann, S.: Two Sides of Modus Ponens. The Journal of Philosophy 115 (11): 605–621 (2018).",
                "Colombo, M. & Hartmann, S.: Bayesian Cognitive Science, Unification and Explanation. The British Journal for the Philosophy of Science 68 (2): 451–484 (2017).",
                "Dawid, R., Hartmann, S. & Sprenger, J.: The No Alternatives Argument. The British Journal for the Philosophy of Science 66 (1): 213–234 (2015).",
                "Frigg, R. & Hartmann, S.: Models in Science, in: The Stanford Encyclopedia of Philosophy (2020).",
                "Dizadji-Bahmani, F., Frigg, R. & Hartmann, S.: Who’s Afraid of Nagelian Reduction?, Erkenntnis 73 (3): 393–412 (2010).",
                "Bovens, L. & Hartmann, S.: Bayesian Epistemology . Oxford: Oxford University Press, 2003.",
                "Beisbart, C., Bovens, L. & Hartmann, S.: A Utilitarian Assessment of Alternative Decision Rules in the Council of Ministers. European Union Politics 6 (4): 395–419 (2005).",
                "Hartmann, S.: The World as a Process: Simulations in the Natural and Social Sciences, in: R. Hegselmann et al. (eds.), Modelling and Simulation in the Social Sciences from the Philosophy of Science Point of View . Dordrecht: Kluwer, 1996, pp. 77–100."
            ]
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.553804"
    },
    {
        "name": "Dr. Edoardo Baccini",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/edoardo-baccini-e2ee93e0.html",
        "description": "Personal information Since September 2025, Edoardo is a postdoctoral researcher at the Munich Center for Mathematical Philosophy at LMU Munich. He obtained a PhD in artificial intelligence at the University of Groningen with a dissertation titled “Logical and Computational Approaches to Dynamics of Intelligent Interaction”. Prior to that, he completed a master’s degree in logic and philosophy of science at LMU Munich in 2021, and a bachelor’s degree in philosophy at the University of Florence in 2019.\n\nResearch interests Edoardo’s research is concerned with the dynamics of knowledge acquisition, belief formation and opinion diffusion in social contexts. At the intersection of social epistemology and formal epistemology, Edoardo makes use of a variety of formal methods (dynamic logics, probability theory and agent-based modeling) to study information dynamics in social groups and in social networks. His current research focuses on: the development of formal frameworks for assessing the adequacy of agent communication (belief merge, preference aggregation) from the standpoint of formal learning theory; the application of Bayesian Networks and agent-based modeling to study the emergence of order effects in single-agent belief dynamics and of social anchoring effects in epistemic collectives; the application of logical tools to model social network phenomena. He is also interested in the philosophical debates around peer review and open science.",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/edoardo_bacchini_1_1_format_s.jpg",
            "email": "E.Baccini@lmu.de",
            "office_address": "Ludwigstrasse 31",
            "room": "Room 129",
            "website": "https://edoardobaccini.wordpress.com/",
            "research_interests_text": "Edoardo’s research is concerned with the dynamics of knowledge acquisition, belief formation and opinion diffusion in social contexts. At the intersection of social epistemology and formal epistemology, Edoardo makes use of a variety of formal methods (dynamic logics, probability theory and agent-based modeling) to study information dynamics in social groups and in social networks. His current research focuses on: the development of formal frameworks for assessing the adequacy of agent communication (belief merge, preference aggregation) from the standpoint of formal learning theory; the application of Bayesian Networks and agent-based modeling to study the emergence of order effects in single-agent belief dynamics and of social anchoring effects in epistemic collectives; the application of logical tools to model social network phenomena. He is also interested in the philosophical debates around peer review and open science."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.366403"
    },
    {
        "name": "Simone Salzano, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/simone-salzano-8e595f3b.html",
        "description": "Further Information I am a PhD candidate in Philosophy of Science at both LMU Munich and the University of Urbino, under the joint supervision of Vincenzo Fano (Urbino) and Stephan Hartmann (LMU). Prior to my doctoral studies, I obtained an MA in Philosophy from the University of Lugano (USI, Switzerland), with a dissertation on the philosophy of quantum mechanics (supervisor: Tim Maudlin). As part of my MA, I spent the Fall 2023 semester as a visiting student at the University of Amsterdam’s Faculty of Science (supported by the Swiss-European Mobility Programme), where I further deepened my engagement with topics at the intersection of physics and philosophy.\n\nResearch Interests My research interests encompass the history and philosophy of physics , the general philosophy of science , and the metaphysics of science . Throughout my academic journey, I have primarily focused on the concepts of emergence and reduction in the physical sciences, the philosophical foundations of quantum mechanics, and ongoing debates surrounding scientific realism in physics. My current PhD project centers on effective field theories, exploring both their historical development and philosophical significance. I am particularly interested in how the intertheoretic relationships among different EFTs can shed new light on, and potentially challenge, traditional philosophical notions such as emergence, reduction, and fundamentality.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/mcmp/downloads/simoen_salzano_1_1_format_s.jpg",
            "email": "Sim.Salzano@gmail.com",
            "office_address": "Geschwister-Scholl-Platz 1"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.609977"
    },
    {
        "name": "Dr. Ignacio Ojea Quintana",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/ignacio-ojea-quintana-dcf2e615.html",
        "description": "Personal information Ignacio Ojea has been an assistant professor at the Chair of Philosophy of Science at the Munich Center for Mathematical Philosophy (MCMP) since 2022. Before that, he was a research associate for three years at the Australian National University's School of Philosophy in Canberra, where he worked on the project Humanising Machine Intelligence . Under the supervision of Prof. Philip Kitcher, he obtained his doctorate in Philosophy in 2019 at Columbia University with a thesis in the field of formal social epistemology. Previously, he obtained a BA and MA in philosophical logic from the University of Buenos Aires, where he was an active member of the Buenos Aires Logic Group .\n\nFull CV\n\nResearch interests Ignacio researches and teaches on issues of general philosophy of science and philosophy of technology, as well as formal and social epistemology, where he makes use of mathematical, computer-aided, and data-driven methods. In his doctoral thesis, he dealt with the question of how consensus and (network) dynamics of a social group can best be represented, based on the attitudes of its individuals, whether that be opinions or judgements of sympathy. Currently, he is working on social media network analysis on controversial topics, and is also interested in the emergent field of philosophy of data science, and in the ethics of autonomous decision making.",
        "metadata": {
            "position": "Assistant Professor",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/ojea-quintana_1_1_format_s.jpg",
            "email": "Ignacio.Ojea@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 131",
            "website": "http://ignacioojea.com/",
            "selected_publications": [
                "I. Ojea Quintana, R. Reimann, M. Cheong, M. Alfano, and C. Klein. Polarization and trust in the evolution of vaccine discourse on Twitter during COVID-19 . In: PLOS ONE 17.12 (2022), pp. 1–21.",
                "C. Klein, R. Reimann, I. Quintana, M. Cheong, M. Ferreira, and M. Alfano. Attention and counter-framing in the Black Lives Matter movement on Twitter . In: Humanities and Social Sciences Communications (2022).",
                "I. Ojea Quintana. Radical Pooling and Imprecise Probabilities . In: Erkenntnis (2022).",
                "C. Evans, C. Benn, I. Ojea Quintana, P. Robinson, and S. Thiebaux. Stochastic Policies in Morally Constrained (C-)SSPs . In: Proceedings of the 2022 AAAI/ACM Conference on AI, Ethics, and Society, AIES ’22 .",
                "M. Alfano, R. Reimann, I. Ojea Quintana, A. Chan, M. Cheong, and C. Klein. The Affiliative Use of Emoji and Hashtags in the Black Lives Matter Movement in Twitter . In: Social Science Computer Review (2022).",
                "I. Ojea Quintana, S. Rosenstock, and C. Klein. The coordination dilemma for epidemiological modelers . In: Biology and Philosophy (2021).",
                "R. Stewart and I. Ojea Quintana. Learning and Pooling, Pooling and Learning . In: Erkenntnis (2018).",
                "R. Stewart and I. Ojea Quintana. Probabilistic Opinion Pooling with Imprecise Probabilities . In: Journal of Philosophical Logic (2018)."
            ],
            "research_interests_text": "Ignacio researches and teaches on issues of general philosophy of science and philosophy of technology, as well as formal and social epistemology, where he makes use of mathematical, computer-aided, and data-driven methods. In his doctoral thesis, he dealt with the question of how consensus and (network) dynamics of a social group can best be represented, based on the attitudes of its individuals, whether that be opinions or judgements of sympathy. Currently, he is working on social media network analysis on controversial topics, and is also interested in the emergent field of philosophy of data science, and in the ethics of autonomous decision making."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.745578"
    },
    {
        "name": "Dr. Daniele Conti",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/daniele-conti-cb04990a.html",
        "description": "Personal information I am a Research Associate at the Chair of Philosophy and Decision Theory at the Munich Center for Mathematical Philosophy. I received my PhD from the University of Manchester (UK) in 2024, with a thesis titled \"The Chances of Freedom. A Study on Free-Will Libertarianism and Objective Probabilities of Undetermined Actions\".\n\nResearch interests My research interests lie at the interstection of philosophy of action, metaphysics and philosophy of science. They concern, in particular, theories of free will and mental causation, emergentism, the metaphysics of causation, probabilities and the laws of nature.\n\nSelected Publications Conti, D., 2025, \"A New Argument for Compatibilism\", Analysis , https://doi.org/10.1093/analys/anaf113 Conti, D., 2024, \"Against an Argument for Objective Probabilities of Undetermined Choices\", American Philosophy Quarterly, 61: 127-137.",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/conti-daniele-foto_1_1_format_s.jpg",
            "email": "Daniele.Conti@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 029",
            "research_interests_text": "My research interests lie at the interstection of philosophy of action, metaphysics and philosophy of science. They concern, in particular, theories of free will and mental causation, emergentism, the metaphysics of causation, probabilities and the laws of nature."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.139525"
    },
    {
        "name": "Dr. Sophie Kikkert",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/sophie-kikkert-cc1a5abd.html",
        "description": "Personal information Sophie Kikkert is an Assistant Professor (Akademische Rätin) at the Chair for Philosophy and Decision Theory, located at the Munich Center for Mathematical Philosophy (MCMP). Previously, she worked as a Fellow at the Center for Advanced Studies: Human Abilities, associated with Humboldt University Berlin. She received her PhD in Philosophy from the London School of Economics and Political Science (LSE) in 2022.\n\nFull CV (PDF, 93 KB)\n\nResearch interests Sophie’s research centres on topics in practical rationality, social philosophy, metaphysics, and epistemology. Her work addresses what it takes to have and exercise abilities, how we learn about our own abilities and options, and what role ability beliefs and attention play in practical reasoning. In addition, she has written about the relation between abilities, disability, and mental health.",
        "metadata": {
            "position": "Assistant Professor",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/kikkert-sophie_1_1_format_s.jpg",
            "email": "S.Kikkert@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 029",
            "website": "https://www.sophiekikkert.com",
            "selected_publications": [
                "Maier, J. & Kikkert, S. (2025). Abilities. Stanford Encyclopedia of Philosophy.",
                "Kikkert, S. & Segundo-Ortin, M. (2025). Disability, Affordances, and the Dogma of Harmony: Socializing the EE-Model of Disability. Topoi 44 (2):517-528.",
                "Kikkert, S. (2022). Ability’s Two Dimensions of Robustness. Proceedings of the Aristotelian Society 122 (3):348-357."
            ],
            "research_interests_text": "Sophie’s research centres on topics in practical rationality, social philosophy, metaphysics, and epistemology. Her work addresses what it takes to have and exercise abilities, how we learn about our own abilities and options, and what role ability beliefs and attention play in practical reasoning. In addition, she has written about the relation between abilities, disability, and mental health."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.875173"
    },
    {
        "name": "Dr. Daniel A. Di Liscia",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/daniel-a-di-liscia-1395aec7.html",
        "description": "Personal information Daniel A. Di Liscia studied philosophy at the University of Buenos Aires with a specialization in the history of late medieval and early modern philosophy (1989). With support first from the DAAD (German Academic Exchange Service) and later from the Antorchas Foundation, he completed his Ph. D. at the LMU München ( summa cum laude ). After three years of collaboration at the Munich Copernicus Edition, he came to the Kepler-Kommission in the Bavarian Academy of Sciences, where he worked for six years, the final four as “Wissenschaftlicher Leiter”.\n\nComplete CV (PDF, 544 KB) Interview in the magazine Ñ (Diario Clarín) (PDF, 422 KB)\n\nResearch interests Daniel A. Di Liscia’s research interest is the history of philosophy and science from late medieval to early modern times. His focus lies on two branches of research: the history of Renaissance cosmology, especially in connection with Nicolaus Copernicus and Johannes Kepler, and the tradition of the “calculators”. The background for both subjects is the same: the late Aristotelian tradition in logic, epistemology and, above all, natural philosophy. Late medieval history of logic and philosophy of language: theory of “ consequentiae ”; syllogistic and concept of deduction in medieval logic and mathematics. Late medieval physics: quantification of motion and qualities within the Aristotelian framework, nature and motion, continuum and infinite; latitude of forms and “configurations doctrine” (Jacob of Naples, Nicole Oresme, Biagio Pelacani da Parma). Humanistic criticism of calculators (Juan Luis Vives). The quantification of Aristotelian metaphysics and the perfection of species (Nicholas of Amsterdam, John of Wesel, Jacques Legrand). Early modern cosmology and history of science: Gravity in Copernicus and Kepler; Kepler on pneumatics; mathematics and metrology in Kepler; the late Aristotelian Tradition and the new cosmology; Renaissance epistemology (the “middle sciences”, regressus demonstrativus and the kind of scientific proofs). Joachim Jungius and late Aristotelianism. Logic-mathematical approaches in traditional philosophical and scientific works (Richard Swineshead, Jean Buridan, Nicole Oresme, Albert of Saxony; Galileo Galilei).\n\nFurther activities in research and teaching Daniel A. Di Liscia remains active as a referee for several journals and international research foundations. In 2007, he was appointed associate member of the “Centro de Estudios Filosóficos Eugenio Pucciarelli (Sección Lógica y Filosofía de la Ciencia)” of the Academia Nacional de Ciencias de Buenos Aires . In 2008, he co-organised at Strasbourg (together with E. Mehl, Université Marc Bloch) the international conference: “Physique, métaphysique, physique céleste Autour de l’Astronomia Nova de Johannes Kepler (1609)”. During 2009-2010, he participated in the Project EEDA (“Une Époque en Édite une Autre”) at the University of Nantes, France (Direction of the Project by Prof. E. Barbin and Prof. G. Stenger). He is collaborating member of Instituto de Filosofia , in the area of Medieval and Early Modern Philosophy of the University of Porto and participates in the project located at the same institute \" From Data to Wisdom \". Di Liscia is member of the international advisory board of the CNERU (Cordoba Near East Research Unit) . During May 2018 he organised the international conference at the MCMP \" Quantifying Aristotle. The Impact, Spread and Decline of the Calculatores Tradition \". Di Liscia has presented papers at universities across Europe, Israel and the Americas. Since the very beginning of his career, Di Liscia has connected his research work with teaching activities. As a lecturer, he has led courses regularly since 2003 on Renaissance cosmology and various other topics concerning the tradition of the “calculatores” at the Renaissance Institute of the LMU and at MCMP. In addition, Di Liscia was a visiting professor at the University of Versailles Saint-Quentin-en-Yvelines and Paris/Diderot (France), and at the Universities of Tres de Febrero and Buenos Aires (Argentina). Thanks to ERASMUS support, he lectured at the University of Chieti/Pescara and at the University of Córdoba (Spain). From October 2024 to May 2025, he was teaching and conducting research at the Technion (Israel Institute of Technology), Department of Humanities and Arts (https://humanities.technion.ac.il/en/staff_cat/guests/) . Di Liscia has held the role of Principal Investigator on several research projects: [1] “From a logic-mathematical standpoint: Richard Swineshead and the calculatores tradition”, (funded by LMU Munich’s Institutional Strategy within the framework of the German Excellence Initiative), [2] “Die Geometrisierung der Metaphysik im Spätmittelalter: Jacobus de Neapoli und die Tradition De perfectione specierum ”, and [3] “Integration und Transformation in der spätmittelalterlichen Naturphilosophie: Jacques L",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "D.DiLiscia@lrz.uni-muenchen.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 122",
            "selected_publications": [
                "2022, Daniel A. Di Liscia (ed.), The concept of Motion in Late Medieval Philosophy. Revista Española de Filosofiía, Special Issue No 29/1.",
                "2022, Daniel A. Di Liscia, Edith D. Sylla (Hg.), Quantifying Aristotle. The Impact, Spread and Decline of the Calculatores Tradition. Leiden: Brill [Medieval and Early Modern Philosophy and Science, ed. by Ch. Lüthy and P. J.J.M. Bakker], in collaboration with P. J.J.M. Bakker. https://brill.com/view/title/60963",
                "2013, Paul Ziche, Petr Rezvykh (cooperation by D. A. Di Liscia), Sygkepleriazein. Schelling und die Kepler-Rezeption im 19. Jahrhundert. Stuttgart, Germany: Verlag frommann-holzboog, [Schellingiana 21].",
                "2009, Friderike Boockmann, Daniel A. Di Liscia, Johannes Kepler. Gesammelte Werke, vol. XXI.2.1. Manuscripta Astrologica – Manuscripta Pneumatica, München: Beck Verlag.",
                "2005, Friederike Boockmann, Daniel A. Di Liscia, Hella Kothmann (eds.), Miscellanea Kepleriana. Festschrift für Volker Bialas zum 65. Geburtstag, Augsburg: Dr. Erwin Rauner Verlag, 2005 (v + 331 pp.) [Algorismus. Studien zur Geschichte der Mathematik und Naturwissenschaften, hrsg. v. Menso Folkerts, Bd. 47].",
                "2005, 06, 07, Roland Z. Bulirsch, Daniel A. Di Liscia, “Berichte der Kepler-Kommission”, Berichte der Kepler-Kommission 15-21 (15-21), München: Eigenverlag.",
                "1997, Daniel A. Di Liscia, Eckhard Kessler, Charlotte Methuen (eds.), Method and Order in Renaissance Philosophy of Nature. The Aristotle Commentary Tradition, Aldershot – Brookfield – Singapore – Sidney: Ashgate, (vii + 409 pp.).",
                "1993, Silvia Magnavacca, Claudia D´Amico, Daniel A. Di Liscia, Antonio Tursi, Cuatro Aspectos de la Crisis filosofófica del Siglo XIV. Buenos Aires: Ediciones Patristica et Medievalia."
            ],
            "research_interests_text": "Daniel A. Di Liscia’s research interest is the history of philosophy and science from late medieval to early modern times. His focus lies on two branches of research: the history of Renaissance cosmology, especially in connection with Nicolaus Copernicus and Johannes Kepler, and the tradition of the “calculators”. The background for both subjects is the same: the late Aristotelian tradition in logic, epistemology and, above all, natural philosophy. Late medieval history of logic and philosophy of language: theory of “ consequentiae ”; syllogistic and concept of deduction in medieval logic and mathematics. Late medieval physics: quantification of motion and qualities within the Aristotelian framework, nature and motion, continuum and infinite; latitude of forms and “configurations doctrine” (Jacob of Naples, Nicole Oresme, Biagio Pelacani da Parma). Humanistic criticism of calculators (Juan Luis Vives). The quantification of Aristotelian metaphysics and the perfection of species (Nicholas of Amsterdam, John of Wesel, Jacques Legrand). Early modern cosmology and history of science: Gravity in Copernicus and Kepler; Kepler on pneumatics; mathematics and metrology in Kepler; the late Aristotelian Tradition and the new cosmology; Renaissance epistemology (the “middle sciences”, regressus demonstrativus and the kind of scientific proofs). Joachim Jungius and late Aristotelianism. Logic-mathematical approaches in traditional philosophical and scientific works (Richard Swineshead, Jean Buridan, Nicole Oresme, Albert of Saxony; Galileo Galilei)."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.895277"
    },
    {
        "name": "Prof. DDr. Hannes Leitgeb",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/hannes-leitgeb-4769c328.html",
        "description": "Personal information Hannes Leitgeb is Chair of Logic and Philosophy of Language and founder and co-director of the Munich Center for Mathematical Philosophy (MCMP). He researches and teaches on questions in logic, philosophy of logic and mathematics, epistemology, philosophy of language, general philosophy of science, the history of logical empiricism and the philosophy of the cognitive sciences. His current research interests include the logic of normative reasons for belief, the analysis of neural networks by means of reason ascriptions, logical inferentialism, logicism in the philosophy of mathematics, the meaning of merely instrumental linguistic devices, and a metaphilosophical understanding of philosophy as rational reconstruction.\n\nCurriculum vitae 2025 Visiting Professor, Pantheon Sorbonne, University of Paris 1 2011 - Member, Munich Center for Neurosciences, LMU Munich 2011 - Member, Center for Advanced Studies, LMU Munich 2010 - Chair of Logic and Philosophy of Language, founder and co-director of the Munich Center for Mathematical Philosophy (MCMP), Dean of Research at the Faculty of Philosophy, Philosophy of Science and Religious Studies 2009 Visiting Professor, Institute for Philosophy, University of Düsseldorf 2007 - 2010 Professor, Departments of Philosophy and Mathematics, University of Bristol, UK 2005 - 2007 Reader, Departments of Philosophy and Mathematics, University of Bristol, UK 2004 - 2005 Erwin Schrödinger Fellow, Department of Philosophy und Center for the Study of Language and Information, Stanford University, USA 2002 - 2005 Assistant Professor in Philosophy, University of Salzburg 2001 PhD in Philosophy, University of Salzburg 1999 - 2002 Postdoc, University of Salzburg 1998 PhD in Mathematics, University of Salzburg 1990 - 1997 Studied Mathematics, Computer Science and Philosophy at University of Salzburg, obtaining a Master in Mathematics View all\n\nFull CV (PDF, 226 KB)\n\nComplete list of publications (PDF, 101 KB)\n\nAcademic distinctions 2025 Gottfried Wilhelm Leibniz Award 2025 Frege Award, Society for Analytic Philosophy (GAP, Gesellschaft für analytische Philosophie) 2023 Member, Académie Internationale de Philosophie des Sciences 2016 Member, Leopoldina 2014 Article in Philosopher‘s Annual 2014 Member, Academia Europaea 2012, 2015, 2018, 2020, 2023 Teaching Award, Fachschaft Philosophie, LMU Munich 2010 Article in Philosopher‘s Annual 2010 Alexander von Humboldt Professorship 2007 Friedrich Wilhelm Bessel Research Prize 2007 Philip Leverhulme Prize, UK\n\nResearch projects Research projects on the following subjects: logic of inductive reasons, the application of this logic for the epistemology of machine learning, logical inferentialism, logicism in the philosophy of mathematics, \"merely expressive devices\". Additionally, a book project on metaphilosophy, rational reconstruction, and logical empiricism is underway.\n\nTeaching Prof. Leitgeb's current courses can be found on LSF . If you wish to write a thesis under Prof. Leitgeb's supervision, please contact him by email, including a few sentences outlining the planned topic, in order to arrange an appointment.\n\nOther activities 2024 - Member, DFG Review Board for Philosophy 2024 - Member of the Advisory Board, Laboratory for Human-Centered AI, Institute for Ethics in AI, Oxford University 2023 - Member of the Committee, Dov-Gabbay-Prize in Logic and Foundations 2021 - Scientific Advisory Board of Ø. Linnebo's ERC project Infinity and Intensionality, University. of Oslo 2020 Panel, Hessische Exzellenzförderung 2019 Three lectures, Mathematical Philosophy Week (Peking) 2016 Panel, ERC Starting Grant 2015 - Panel, DFG Philosophical Symposia 2015 (Co-)organiser of the 15th Congress of Logic, Methodology and Philosophy of Science (Helsinki) 2015 1st Bonn Logic Lecture (Bonn) 2014 - Advisory Board, Joint Research Center in Logic, Tsinghua Universtät and the University of Amsterdam 2014 Descartes Lectures (Tilburg) 2013 Theoria Lecture (Stockholm) 2012 Panel, DFG Centers for Advanced Studies in Humanities and Social Sciences 2010 Sigma Lectures (Paris) 2008 Panel, European Science Foundation Eurocores 2008 (Co-)organiser, Wittgenstein Symposium (Kirchberg) 2006 Advisory Committee for Humanities, Austrian Science Fund (FWF) 2005 Vienna Circle Beth Lecture (Amsterdam) Editorial Boards: Editor-in-Chief of Erkenntnis (since 1.1.11). Coordinating Editor of Review of Symbolic Logic (1.1.13 - 31.12.15). Editor of Review of Symbolic Logic (23.12.10 - 31.12.12). Consulting Editor of Theoria (since 14.12.07). Managing Editor of Studia Logica (15.12.05 - 30.11.11). Subject Editor for the Stanford Encyclopedia of Philosophy (since 1.10.05). Co-founder and co-editor of LOGOS, Book Series in Logic, Metaphysics, and Philosophy of Language (Ontos, 2002--2015). Editorial Board of Semantics and Pragmatics (since 2015). Editorial Board of Studies in Theoretical Philosophy , Klostermann Verlag (since 2013). Editorial Board of European Journ",
        "metadata": {
            "position": "Chair, Co-director of the MCMP",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/leitgebphoto2024_1_1_format_s.jpg",
            "email": "Hannes.Leitgeb@lmu.de",
            "phone": "+49 89 2180-6171",
            "office_address": "Ludwigstraße 31",
            "room": "Room 226",
            "selected_publications": [
                "Leitgeb, H. Ramsification and Semantic Indeterminacy. Review of Symbolic Logic 16/3: 900–950 (2023).",
                "Leitgeb, H. and Carus, A.: Rudolf Carnap, in: The Stanford Encyclopedia of Philosophy , 324 pdf pages (2020).",
                "Leitgeb, H. HYPE: A System of Hyperintensional Logic (With an Application to Semantic Paradoxes. Journal of Philosophical Logic 48/2: 305–405 (2019).",
                "Leitgeb, H.: The Stability of Belief. How Rational Belief Coheres with Probability . Oxford: Oxford University Press, 2017.",
                "Leitgeb, H. The Stability Theory of Belief. The Philosophical Review 123/2: 131–171 (2014).",
                "Leitgeb, H. and Pettigrew, R. An Objective Justification of Bayesianism I: Measuring Inaccuracy. Philosophy of Science 77/2: 201–235 (2010).",
                "Leitgeb, H. and Ladyman, J.: Criteria of Identity and Structuralist Ontology. Philosophia Mathematica 16/3: 388–396 (2008).",
                "Leitgeb, H.: What Theories of Truth Should Be Like (But Cannot Be). Blackwell Philosophy Compass 2/2: 276–290 (2007).",
                "Leitgeb, H.: What Truth Depends On. Journal of Philosophical Logic 34/2: 155–192 (2005).",
                "Leitgeb, H.: Inference on the Low Level. An Investigation into Deduction, Nonmonotonic Reasoning, and the Philosophy of Cognition . Dordrecht: Kluwer, 2004."
            ]
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.757668"
    },
    {
        "name": "Dr. Ina Jäntgen",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/ina-jaentgen-cbafe132.html",
        "description": "Personal information I recently completed my PhD in Philosophy at the University of Cambridge. My PhD thesis discussed how scientists could use effect sizes of tested interventions to inform rational decision-making. Before Cambridge, I completed a Research Master's in Philosophy and Economics at the Erasmus University of Rotterdam, and Bachelor degrees in Philosophy and Economics at the University of Freiburg. I joined the Munich Center for Mathematical Philosophy (MCMP) in October 2024.\n\nResearch interests I specialise in philosophy of science, with a focus on philosophy of the biomedical and social sciences, and in formal epistemology and decision theory. Currently, I focus on topics relevant to how science can best produce knowledge helpful for decision-makers. You can find out more about my projects on my personal website .",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/ina-jaentgen_groesse-m_1_1_format_s.jpg",
            "email": "Ina.Jaentgen@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 124",
            "website": "https://sites.google.com/view/inajantgen/home",
            "research_interests_text": "I specialise in philosophy of science, with a focus on philosophy of the biomedical and social sciences, and in formal epistemology and decision theory. Currently, I focus on topics relevant to how science can best produce knowledge helpful for decision-makers. You can find out more about my projects on my personal website ."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.397378"
    },
    {
        "name": "apl. Prof. Dr. Martin Rechenauer",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/martin-rechenauer-e67091ec.html",
        "description": "Research interests My research interests concern mainly foundational issues in practical philosophy: theories of justice, contractualist justification procedures, all branches of the theory of rational choice (decision theory, game theory and social choice theory) in general and in their application to questions of practical philosophy. Other central research interests address conceptions of collective intentionality. Besides, I am very interested in philosophy of probability, questions of formal epistemology, political philosophy, philosophy of economics. Historically, I focus on the tradition of social contract theory. I am assistant editor of the Theory and Decision Library Series A at Springer publishers, have organized a DAAD-funded cooperation of the Munich Chair of Philosophy and Political Theory with Prof. Raimo Tuomela and his research group at Helsinki, and worked as co-organizer for the 6th Decision Games and Logic workshop at MCMP in summer 2012.",
        "metadata": {
            "position": "Adjunct Professor",
            "organizational_unit": "Chair of Philosophy and Political Theory",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/rechenauer-photo_1_1_format_s.jpg",
            "email": "Martin.Rechenauer@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31 (Rgb.)",
            "selected_publications": [
                "Rechenauer, Martin (2014): Aggregation ist doch möglich – Lektionen für philosophische Gerechtigkeitstheorien .",
                "Rechenauer, Martin (2012): Soziale Marktwirtschaft und Gerechtigkeit. Eine Perspektive aus der Philosophie . In: Vanberg, Viktor J. (Hg.): Marktwirtschaft und soziale Gerechtigkeit . Tübingen: Mohr.",
                "Rechenauer, Martin (2011): On Sen's Idea of a Theory of Justice . XXII. Deutscher Kongress für Philosophie, 11. - 15. September 2011, Ludwig-Maximilians-Universität München (Volltext verfügbar).",
                "Nida-Rümelin, Julian / Rechenauer, Martin (2009). Internationale Gerechtigkeit. In: Internationale Politik als Überlebensstrategie , hrsg. von Mir A. Ferdowsi. Bayerische Landeszentrale für politische Bildung 2009.",
                "Rechenauer, Martin (2009): Kontraktualistische Gerechtigkeitstheorien und die Idee eingebetteter Selbste . In: Archiv für Rechts- und Sozialphilosophie 95 (1), 62-78.",
                "Rechenauer, Martin (2008): On the Non-equivalence of Weak and Strict Preference , In: Mathematical Social Sciences , 56 (3), 386-388."
            ],
            "research_interests_text": "My research interests concern mainly foundational issues in practical philosophy: theories of justice, contractualist justification procedures, all branches of the theory of rational choice (decision theory, game theory and social choice theory) in general and in their application to questions of practical philosophy. Other central research interests address conceptions of collective intentionality. Besides, I am very interested in philosophy of probability, questions of formal epistemology, political philosophy, philosophy of economics. Historically, I focus on the tradition of social contract theory. I am assistant editor of the Theory and Decision Library Series A at Springer publishers, have organized a DAAD-funded cooperation of the Munich Chair of Philosophy and Political Theory with Prof. Raimo Tuomela and his research group at Helsinki, and worked as co-organizer for the 6th Decision Games and Logic workshop at MCMP in summer 2012."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.337258"
    },
    {
        "name": "Dr. Lennart Ackermans",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/lennart-ackermans-b494dccf.html",
        "description": "Personal information I received my PhD from Erasmus University Rotterdam in 2023. After a short hiatus, I started in September 2024 at the MCMP on a Research Fellowship from the Alexander von Humboldt foundation. My PhD research was about measuring causation in economics and social science, as well as some topics in Bayesian epistemology. Before that, I obtained a Research MA in Philosophy and Economics from Erasmus University Rotterdam and a BSc in Mathematics from Leiden University.\n\nResearch interests My research interests are on the intersection between philosophy of science and formal ethics. In particular, I am interested in causal concepts that are used and measured in the social sciences, which raise questions relating to causal methodology, the metaphysics of causation and ethics. I am currently working on the concept of discrimination, which I argue should be defined causally. There are many open challenges about the correct way to define discrimination (causally or otherwise) and the right (causal) methods to measure discrimination. I am also interested in Bayesian epistemology.",
        "metadata": {
            "position": "AvH Research Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/ackermans-lennart-photo_1_1_format_s.jpg",
            "email": "L.Ackermans@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 129",
            "selected_publications": [
                "Ackermans, L.B. 2023. Reflections on the 2021 Nobel Memorial Prize Awarded to David Card, Joshua Angrist, and Guido W. Imbens . Erasmus Journal for Philosophy and Economics 16 (1): 77–96.",
                "Ackermans, L.B. 2022. Causal Bias in Measures of Inequality of Opportunity . Synthese 200: 6.",
                "Ackermans, L.B. 2022. Infinite Frequency Principles of Direct Inference . Synthese 200: 164."
            ],
            "research_interests_text": "My research interests are on the intersection between philosophy of science and formal ethics. In particular, I am interested in causal concepts that are used and measured in the social sciences, which raise questions relating to causal methodology, the metaphysics of causation and ethics. I am currently working on the concept of discrimination, which I argue should be defined causally. There are many open challenges about the correct way to define discrimination (causally or otherwise) and the right (causal) methods to measure discrimination. I am also interested in Bayesian epistemology."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.448473"
    },
    {
        "name": "Wu Dawei, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/wu-dawei-0ac66678.html",
        "description": "Personal information I obtained my Master's degree from the Free University of Berlin, where my thesis focused on metaphysical emergence and the autonomy of higher-level entities. Since joining MCMP in October 2024, I have been working under the supervision of Prof. Dr. Christian List.\n\nPhD project My current research, as part of my dissertation project, explores the conceptualization and metaphysical foundation of free will, approached through the lens of interlevel metaphysics.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/wu-dawei-photo_1_1_format_s.jpg",
            "email": "Dawei.Wu@campus.lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 223"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.732868"
    },
    {
        "name": "Anne Deng, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/anne-deng-e14c1018.html",
        "description": "Research interests I am interested in General Philosophy of Science, Philosophy of Physics, and Philosophy of Mathematics. My PhD project examines Structural Realism in physics and mathematics from a Quinean perspective.",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language",
            "email": "H.Deng1@campus.lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 225",
            "research_interests_text": "I am interested in General Philosophy of Science, Philosophy of Physics, and Philosophy of Mathematics. My PhD project examines Structural Realism in physics and mathematics from a Quinean perspective."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.564932"
    },
    {
        "name": "Felix Rohls, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/felix-rohls-135a9c39.html",
        "description": "Personal information I have been working as a doctoral student under the supervision of Prof. DDr. Hannes Leitgeb since October 2018. Before that, I obtained a BA in Art History and Philosophy (2012-16; 1.2) and an MA in Philosophy (2016-18; 1.0), both at LMU Munich. My MA thesis, also supervised by Hannes Leitgeb, dealt with Transcendental Arguments in Contemporary Continental Philosophy. I am planning to complete my dissertation in 2025.\n\nResearch interests The focus of my research lies on the philosophy of language, specifically on natural language semantics and metasemantics. For my PhD, I am working on the theory of names, focusing on the predicativist view that names are predicates (title: Names and Predicates. A Critique of Predicativism). Beyond that, my philosophical interests include various fields, in particular metaphysics, aesthetics/philosophy of art, and the reconstruction and evaluation of theories from continental philosophy with analytic methods.",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "MCMP",
            "email": "Felix.Rohls@campus.lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 225",
            "research_interests_text": "The focus of my research lies on the philosophy of language, specifically on natural language semantics and metasemantics. For my PhD, I am working on the theory of names, focusing on the predicativist view that names are predicates (title: Names and Predicates. A Critique of Predicativism). Beyond that, my philosophical interests include various fields, in particular metaphysics, aesthetics/philosophy of art, and the reconstruction and evaluation of theories from continental philosophy with analytic methods."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.232242"
    },
    {
        "name": "Dr. Bianca Scheeff",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/bianca-scheeff-5aab6c10.html",
        "description": "Secretary's e-mail at the Chair of Philosophy and Political Theory (Prof. Dr. Laura Valentini): Office.Valentini@lrz.uni-muenchen.de Secretary's e-mail at the Chair of Philosophy and Decision Theory (Prof. Dr. Christian List): Office.List@lrz.uni-muenchen.de\n\nPersonal information Bianca Scheeff completed her doctorate at the Munich School of Philosophy with a dissertation on the concept of reality in Hegel and Aristotle. Her dissertation, entitled Thought and Reality , was published in May 2025. Since May 2024, she has been managing the offices of Prof. Christian List (Chair of Philosophy and Decision Theory) and Prof. Laura Valentini (Chair of Philosophy and Political Theory).",
        "metadata": {
            "position": "Secretary",
            "organizational_unit": "Chair of Philosophy and Political Theory",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/scheeff-bianca-portrait_1_1_format_s.jpg",
            "email": "Office.Valentini@lrz.uni-muenchen.de",
            "phone": "+49 89 2180-1807",
            "office_address": "Geschwister-Scholl-Platz 1"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.798919"
    },
    {
        "name": "Daniel Misselbeck-Wessel, PhD",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/daniel-misselbeck-wessel-8444ea35.html",
        "description": "Personal information Daniel Misselbeck-Wessel studied mathematics in Munich, Berlin, Trento, and Verona. He completed his PhD in 2018 and subsequently held postdoctoral positions at the Department of Computer Science at the University of Verona and the Department of Mathematics at LMU Munich. In 2023/24, he was a Junior Fellow at the Alfried Krupp Institute for Advanced Study in Greifswald.\n\nResearch interest Daniel's research interests include constructive algebra, point-free topology, and the history of proof theory. His current DFG project investigates Gerhard Gentzen's extant shorthand notes on the consistency problem of analysis.\n\nComplete list of publications (PDF, 60 KB)",
        "metadata": {
            "position": "Postdoctoral Researcher",
            "organizational_unit": "MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/photo-misselbeck-wessel_1_1_format_s.jpg",
            "email": "Daniel.Wessel@lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 223",
            "selected_publications": [
                "Partial valuations hide the contaminating value. Australas. J. Log., accepted for publication, 2025.",
                "Boolean rigs (with Iosif Petrakis). Algebra Univers., 86:29, 2025. DOI: 10.1007/s00012-025-00904-9",
                "Maximal elements with minimal logic. Inform. Process. Lett., 182:106403, 2023. DOI: 10.1016/j.ipl.2023.106403 .",
                "Radical theory of Scott-open filters (with P. Schuster). Theoret. Comput. Sci., 945:113677, 2023. DOI: 10.1016/j.tcs.2022.12.027 ."
            ]
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.399720"
    },
    {
        "name": "Johannes Bommes, M.Sc.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/johannes-bommes-3787baf0.html",
        "description": "PhD project I am a PhD student at the MCMP and the Graduate School of Systemic Neurosciences (GSN) under the supervision of Prof. Dr. Stephan Hartmann . Before that, I obtained a B.Sc. and an M.Sc. in Psychology from the University of Göttingen and an M.Sc. in Artificial Intelligence from KU Leuven. I am interested in the relations between different levels of analysis in science. In my PhD project, I work on a framework for the formal analysis of these inter-level relations. Towards this end, I draw on methods from computability theory and algorithmic information theory. A particular focus of my project is on levels of analysis in empirical cognitive science. Beyond that, I am interested in general philosophy of science, philosophy of mind, complex systems, and logic.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP, GSN",
            "email": "J.Bommes@campus.lmu.de",
            "office_address": "Ludwigstraße 31"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.635919"
    },
    {
        "name": "Lilian von Bressensdorf",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/lilian-von-bressensdorf-74110c6e.html",
        "description": "Personal information I am a PhD student supervised by Prof. Stephan Hartmann . Before, I obtained a B.Eg. in mechanical engineering and a M.A in Logic and Philosophy of Science. My M.A. thesis was situated in the discipline of social choice theory, and I modelled social deliberation on preference rankings.\n\nPhD project My dissertation concerns biases in communication and seeks strategies for making them beneficial. In this context, I ask whether chatbot implementation in social media can shift users’ beliefs and biases towards a more desirable direction. I aim to develop an agent-based model which is built on empirics. My broader philosophical interests include collective decision-making and the tension between individual and collective obligations.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "email": "L.Bressensdorf@campus.lmu.de"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.385079"
    },
    {
        "name": "apl. Prof. Dr. Alexander Reutlinger",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/alexander-reutlinger-cbd104f8.html",
        "description": "Personal information Alexander Reutlinger is Akademischer Oberrat auf Lebenszeit and außerplanmäßiger Professor at the Munich Center for Mathematical Philosophy (Chair of Philosophy of Science) and the Faculty of Philosophy, Philosophy of Science and Religious Studies. Together with Norbert Gratzl, he coordinates the Master program in Logic and Philosophy of Science . Alexander Reutlinger’s research and teaching are concerned with topics in (general) philosophy of science and neighboring areas of epistemology and metaphysics. His current research interests include critical analyses of the claims and arguments of strategic science skeptics as well as invariance theories of scientific objectivity.\n\nCurriculum vitae 2023 - Außerplanmäßiger Professor, Munich Center for Mathematical Philosophy (MCMP), LMU Munich 2022 - Akademischer Oberrat auf Lebenszeit, MCMP, LMU Munich 2020 - 2021 Visiting Fellow, Institute Vienna Circle, University of Vienna 2017 - 2019 Vice Dean, Faculty of Philosophy, Philosophy of Science and Religious Studies 2017 - 2022 Akademischer Rat auf Lebenszeit, MCMP, LMU Munich 2017 Habilitation, LMU Munich (Venia: Philosophy) 2013 - 2017 Akademischer Rat auf Zeit, MCMP, LMU München 2012 - 2013 Visiting Fellow, Center for Philosophy of Science, University of Pittsburgh 2011 - 2013 Wissenschaftlicher Mitarbeiter, DFG Research Group Causation and Explanation , University of Cologne 2011 Doctorate in Philosophy (Dr. phil.), University of Cologne 2010 - 2011 Wissenschaftlicher Mitarbeiter, DFG Research Group Causation and Explanation , University of Cologne 2010 Doctoral Research Associate, Philosophy Department, University of Bristol 2001 - 2008 Magister Artium in Philosophy and General and Comparative Literature, Freie Universität Berlin View all\n\nComplete list of publications (PDF, 170 KB)\n\nAcademic distinctions 2017 and 2021 : Teaching Excellency Award (first place 2017, third place 2021), awarded by the Philosophy Fachschaft at LMU Munich 2013 Offerman-Hergarten Prize for doctoral dissertations, University of Cologne 2008 - 2010 Doctoral scholarship, Studienstiftung des deutschen Volkes\n\nResearch projects Alexander Reutlinger's current research projects and interests include: Strategic Science Skepticism (especially the critical analysis of the claims and arguments of strategic science skeptics, the distinction between strategic science skepticism and legitimate/productive criticism of science) Scientific Objectivity (especially invariance-theoretic definitions of objectivity, consequences of such invariance theories for conceputal connections between objectivity and (empirical and testimonial) evidence, symmetry, necessity, and causality) Science and/for Democracy (normative philosophical contributions – inspired by the work of Otto Neurath – to science literacy, a revival of a scientific world conception, the roles of scientific information and experts in democratic decision-making, scientific utopias and evidence-based planning) Philosophy within Literature (how philosophical themes – including time, collective memory, utopianism, enlightenment, and logical empiricism – are expressed in 20th and 21st century novels and essays; authors in focus include Jean Améry, Robert Musil and Gerhard Roth) Older research interests which still influence Alexander Reutlinger's research: Scientific Explanations (especially counterfactual theories of causal and non-causal explanations in scientific and mathematical contexts) Laws of Nature, Generalizations, Models (especially ceteris paribus laws, idealized laws and models, universality and invariance of laws) Causation (especially counterfactual and interventionist theories of causality, neo-Russellian arguments about causation)\n\nTeaching Alexander Reutlinger's current courses can be found on LSF . If you wish to write a thesis under Alexander Reutlinger's supervision, please contact him by email, including a few sentences outlining the planned topic.\n\nOther activities Alexander Reutlinger is engaged in communicating philosophy of science to the wider public. Here is a selection of his communication projects: Reutlinger, A. and Sandner, G. (forthcoming): „Isotype und Utopie. Wirklichkeitssinn und Möglichkeitssinn bei Otto Neurath“, Wespennest. Zeitschrift für brauchbare Texte und Bilder . 2024 Installation of a memorial plaque for Otto Neurath at the Haydnhof Gemeindebau in Vienna (January 2024). The project was initiated together with Günther Sandner (University of Vienna) and brought to fruition in cooperation with \"Wiener Wohnen\" and Karmen Minassian (SPÖ) of the Meidling district council in Vienna. 2023 Consulting work for the blog \"Verfassungsblog. On Matters Constitutional\" on strategic science skepticism and attacks on science motivated by right-wing extremism. 2020 - 2021 Socially Engaged Philosophy - a communication project by Maria Kronfeldner (Central European University, Vienna), Martin Kusch (University of Vienna), an",
        "metadata": {
            "position": "Akademischer Oberrat (a.L.)",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "email": "Alexander.Reutlinger@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 130",
            "selected_publications": [
                "Reutlinger, A. (2022): When Do Non-Epistemic Values Play an Epistemically Illegitimate Role in Science? How to Solve One Half of the New Demarcation Problem. In: Studies in the History and Philosophy of Science 92: 152-161.",
                "Reutlinger, A. (2020): What is Epistemically Wrong With Research Affected by Sponsorship Bias? An Evidential Account . In: European Journal for Philosophy of Science 10: 1-26.",
                "Reutlinger, A., Hangleiter, D., Hartmann, S. (2018): Understanding (With) Toy Models. In: The British Journal for the Philosophy of Science 69: 1069-1099.",
                "Reutlinger, A. (2018): Extending the Counterfactual Theory of Explanation. A Monist Account of Causal and Non-Causal Explanations. In: A. Reutlinger and J. Saatsi (eds.), Explanation Beyond Causation , Oxford: Oxford University Press: 74-95.",
                "Reutlinger, A. (2016): Is There A Monist Theory of Causal and Non-Causal Explanations? The Counterfactual Theory of Scientific Explanation. In: Philosophy of Science 83: 733-745.",
                "Reutlinger, A. (2016): Does the Counterfactual Theory of Explanation apply to Non-Causal Explanations in Metaphysics?. In: European Journal for Philosophy of Science 7: 239–256.",
                "Reutlinger, A. (2014): Why Is There Universal Macro-Behavior? Renormalization Group Explanation As Non-causal Explanation. In: Philosophy of Science 81: 1157-1170.",
                "Reutlinger, A. (2014): Do Statistical Laws Solve the Problem of Provisos? In: Erkenntnis 79: 1759-1773.",
                "Reutlinger, A. (2013): A Theory of Causation in the Biological and Social Sciences , New York: Palgrave Macmillan.",
                "Reutlinger, A. (2012): Getting Rid of Interventions. In: Studies in the History and Philosophy of Science Part C 43 (4): 787-795."
            ]
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.472956"
    },
    {
        "name": "Matteo De Benedetto",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/matteo-de-benedetto-0b38816d.html",
        "description": "Personal information I am an Assistant Professor (RTD-a) of Logic and Philosophy of Science at the IMT School for Advanced Studies Lucca , where I work within the Models, Inferences, and Decisions (MInD) group of the Molecular Mind Laboratory (MoMiLab) research unit. Before Lucca, I was a postdoctoral researcher at the Ruhr University Bochum in the Emmy-Noether research group From Perception to Belief and Back Again . I obtained my PhD in Philosophy at the Munich Center for Mathematical Philosophy , of which I remain an external member.\n\nResearch interests My research interests lie mainly in analytic philosophy, logic, and cognitive science.",
        "metadata": {
            "position": "External Member",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "Matteo.Debenedetto@ruhr-uni-bochum.de",
            "website": "http://mttdebenedetto.scienceontheweb.net/",
            "research_interests_text": "My research interests lie mainly in analytic philosophy, logic, and cognitive science."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.816091"
    },
    {
        "name": "Prof. Dr. Christian List",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/christian-list-087028b0.html",
        "description": "Personal information Christian List has been the Chair of Philosophy and Decision Theory, as well as the co-director of the Munich Center for Mathematical Philosophy , since 2021. Previously, he was Professor of Philosophy and Political Science at the London School of Economics, where, until 2024, he continued to hold a visiting professorship after his move to Munich. His work at the intersection of philosophy, economics, and political science concerns the decision-making behavior and rationality of individual agents and collectives. Another focus of his research is the metaphysics and philosophy of mind, where he is especially concerned with free will, the idea of mental causation, the concept of consciousness, and the first-person perspective. Moreover, he is interested in questions from the philosophy of science, including about the connections between different levels of description (e.g. \"micro\" vs. \"macro\" levels) in the natural and social sciences. His latest book Why Free Will is Real was published in 2019 by Harvard University Press.\n\nCurriculum vitae 2021 - Professor of Philosophy and Decision Theory, as well as co-director of the Munich Center for Mathematical Philosophy, LMU Munich 2021 - 2024 Visiting Professor, Department of Philosophy, Logic and Scientific Method, London School of Economics 2007 - 2020 Professor of Philosophy and Political Science, London School of Economics 2018 Fellow, Forschungskolleg Humanwissenschaften, Goethe University Frankfurt 2015 Visiting Professor of Law, Harvard Law School 2014 Visiting Researcher, Department of Philosophy, University of Uppsala 2014 Harsanyi Fellow, School of Philosophy, Australian National University 2011 Fellow, Swedish Collegium for Advanced Study 2006 - 2011 Visiting Researcher (three times), Research School of Social Sciences, Australian National University 2009 - 2010 L.S. Rockefeller Visiting Fellow, University Center for Human Values, Princeton University 2006 Visiting Research Scholar, Princeton University 2002 - 2007 Lecturer, then Reader, in Political Science, London School of Economics 2003 Postdoctoral Research Fellow, Research School of Social Sciences, Australian National University 2001 - 2003 Postdoctoral (Prize) Research Fellow, Nuffield College, Oxford 2000 - 2001 Visitor, Center for Basic Research in the Social Sciences, Harvard University 2000 - 2001 Visiting Scholar, Department of Linguistics and Philosophy, MIT 2001 DPhil in Politics, University of Oxford (Nuffield College) 2000 Harsanyi Program Visitor, RSSS, Australian National University 1998 MPhil in Politics, University of Oxford (St Peter’s College) 1996 BA in Mathematics and Philosophy, University of Oxford (St Peter’s College) View all\n\nAcademic distinctions 2023 - Member, Academia Europaea 2022 - Member, Bavarian Academy of Sciences and Humanities 2014 - Fellow of the British Academy (FBA) 2020 Joseph B. Gittler Award from the American Philosophical Association 2013 - 2016 Leverhulme Major Research Fellowship 2010 Social Choice and Welfare Prize (shared with F. Dietrich) 2008 \"One of 10 ‘rising stars’ in British academia\", Times Higher Education 2007 Philip Leverhulme Prize in Philosophy and Ethics 2005 Nuffield Foundation New Career Development Fellowship (with F. Dietrich) 1998 - 2001 Doctoral scholarships from the Studienstiftung des deutschen Volkes and the Economic and Social Research Council (UK) 1996 - 1998 Oxford University Scatcherd European Scholarship 1994 - 1996 Domus Scholarship, St Peter’s College, Oxford 1992 - 1998 Scholarship from the Studienstiftung des deutschen Volkes 1990 National champion in Mathematics / Computer Science, \"Jugend forscht\" science competition\n\nTeaching Prof. List's current courses can be found on LSF . If you wish to write a thesis under Prof. List's supervision, please contact him by email, including a few sentences outlining the planned topic, in order to arrange an appointment.\n\nOther activities Editorships 2015 - Subject editor, Philosophy of Social Science, Stanford Encyclopedia of Philosophy 2007 - 2012 Editor, Economics and Philosophy Member of the Editorial Board: BSPS Open (since 2020), Mind (since 2015), Economics and Philosophy (since 2015), Episteme (since 2005), Journal of Logic and Computation (since 2006).",
        "metadata": {
            "position": "Chair, Co-director of the MCMP",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/list-christian_1_1_format_s.jpg",
            "email": "Office.List@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31 (Rgb.)",
            "website": "http://christianlist.net",
            "selected_publications": [
                "List, C. (2023). “The Many-Worlds Theory of Consciousness.” Noûs 57(2): 316–340.",
                "List, C. (2019). Why Free Will is Real . Cambridge, MA: Harvard University Press.",
                "Dietrich, F. & List, C. (2017). “What matters and how it matters: A choice-theoretic representation of moral theories.” Philosophical Review 126 (4): 421–479.",
                "List, C. (2014). “Free Will, Determinism, and the Possibility of Doing Otherwise.” Noûs 48 (1): 156–178.",
                "Dietrich, F. & List, C. (2013). “A reason‐based theory of rational choice.” Noûs 47 (1): 104–134.",
                "List, C. & Pettit, P. (2011). Group Agency: The Possibility, Design, and Status of Corporate Agents . Oxford: Oxford University Press.",
                "List, C. & Menzies, P. (2009). “Non-Reductive Physicalism and the Limits of the Exclusion Principle.” Journal of Philosophy 106 (9): 475–502.",
                "Dryzek, J. S. & List, C. (2003). “Social choice theory and deliberative democracy: a reconciliation.” British Journal of Political Science 33 (1): 1–28.",
                "List, C. & Pettit, P. (2002). “Aggregating sets of judgments: An impossibility result.” Economics & Philosophy 18 (1): 89–110.",
                "List, C. & Goodin, R. E. (2001). “Epistemic democracy: generalizing the Condorcet jury theorem.” Journal of Political Philosophy 9 (3): 277–306."
            ]
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.057084"
    },
    {
        "name": "Dr. Luis Lopez",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/luis-lopez-3aa6b8b3.html",
        "description": "Personal information I joined the MCMP in 2024. Before that, I was a Wissenschaftlicher Mitarbeiter at Leibniz Universität Hannover (LUH) for four years as part of the DFG Research Training Group Integrating Ethics and Epistemology of Scientific Research , where I pursued my doctoral studies in Philosophy of Science. I also earned an MA in Philosophy of Science from LUH. My transition to philosophy followed three years of postdoctoral research at Northwestern University, where I worked at the Center for Computation and Theory of Soft Materials and the Center for Bio-inspired Energy Science. These positions built upon my scientific training in Argentina, where I earned degrees in physics (PhD) and molecular biology (BS, MS)\n\nResearch interests I've been working on philosophical questions concerning machine learning (ML) models in scientific research, particularly focusing on the representational capacities of these models and their implications for scientific understanding. More recently, my research has expanded towards developing a rigorous, computationally implementable, and philosophically informed relational framework based on category theory. This framework aims at enabling the comparison, transfer, and integration of conceptual structures across different research contexts.\n\nTeaching (LMU) Winter term 2025/26: Computational Methods in Philosophy, Introduction to Python Summer term 2025: Introduction to the Philosophy of Biology",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/mcmp/lopez_luis_org_1_1_format_s-2.jpg",
            "email": "Luis.Lopez@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 126",
            "selected_publications": [
                "Barman, K. G., Caron, S., Sullivan, E., de Regt, H. W., de Austri, R. R., Boon, M., ... Lopez, L., …Weniger, C. (2025). Large physics models: Towards a collaborative approach with large language models and foundation models . arXiv. https://arxiv.org/abs/2501.05382",
                "Lopez, L. (in press). Rethinking computational implementation through Symphoria. In M. te Vrugt (Ed.), Artificial intelligence and intelligent matter . Springer Nature.",
                "Google Scholar"
            ],
            "research_interests_text": "I've been working on philosophical questions concerning machine learning (ML) models in scientific research, particularly focusing on the representational capacities of these models and their implications for scientific understanding. More recently, my research has expanded towards developing a rigorous, computationally implementable, and philosophically informed relational framework based on category theory. This framework aims at enabling the comparison, transfer, and integration of conceptual structures across different research contexts."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.396209"
    },
    {
        "name": "Dr. Conrad Friedrich",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/conrad-friedrich-65ec0395.html",
        "description": "Personal information I’m a postdoc at the Munich Center for Mathematical Philosophy (MCMP) at LMU Munich. My research focuses on epistemology and the philosophy of language. I’m also interested in issues in philosophical logic, the philosophy of artificial intelligence, and metaphysics. I obtained a PhD in philosophy from LMU Munich with a dissertation defending a truth conditional account of communication against challenges from semantic indeterminacies , supervised by Hannes Leitgeb and Christian List.",
        "metadata": {
            "position": "Postdoctoral fellow",
            "organizational_unit": "MCMP",
            "email": "Conrad.Friedrich@lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 225",
            "website": "https://conradfriedrich.github.io/"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.694479"
    },
    {
        "name": "Dr. Simon Graf",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/simon-graf-37bde1e4.html",
        "description": "Personal information Since January 2025, I have been a research associate at the Chair of Philosophy and Decision Theory. Before joining the MCMP, I was a research fellow at the Institute Vienna Circle were I was working on the topic of \"epistemic conflicts\". In 2024 I received my PhD from the University of Leeds (UK) as PhD-researcher affiliated with the ERC-funded project \"Group Thinking: New Foundations\" on contemporary issues in social ontology and collective epistemology.\n\nResearch interests My current research focus lies in epistemology, especially the intersection between collective and social epistemology. I am also interested in various related epistemological questions in philosophy of science, philosophy of mind, and decision theory.",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/graf-simon-foto_1_1_format_s.jpg",
            "email": "Simon.Graf@lmu.de",
            "phone": "+43 676 7309032",
            "office_address": "Ludwigstraße 31",
            "room": "Room 033",
            "website": "https://simongraf.weebly.com/",
            "selected_publications": [
                "Graf, Simon (forthcoming). Generic Epistemology. Ergo: An Open Access Journal of Philosophy. DOI: https://doi.org/10.3998/ergo.8884",
                "Graf, Simon (2025). Epistemic Justification and Higher-Order Requirements. Episteme. First View. 1-23 DOI: https://doi.org/10.1017/epi.2025.10093",
                "Graf, Simon & Dang, Haixin (2025). Divergence Arguments in Collective Epistemology. Philosophy Compass, 20 (6). DOI: https://doi.org/10.1111/phc3.70045",
                "Graf, Simon (2025). The No-Defeater Clause. Episteme. First View. 1-25. DOI: https://doi.org/10.1017/epi.2025.4",
                "Wang, Cuizhu, Graf, Simon, & Werner, Konrad (2025). An Operational Definition of Institutional Beliefs. In Dyrda Adam et al. (Eds.) Ethics of Institutional Beliefs: from Theoretical to Empirical. Edward Elga.",
                "Vickers, Peter,… Graf Simon,… (2024). Development of a Novel Methodology for Ascertaining Scientific Opinion and Extent of Agreement. PLoS ONE, 19 (12). DOI: https://doi.org/10.1371/journal.pone.0313541",
                "Graf, S. (2024). On the Nature and Relationship of Individual and Collective Justification. Dissertation. University of Leeds. OAI: https://etheses.whiterose.ac.uk:35226",
                "Graf, Simon (2023). Permissive Divergence. Canadian Journal of Philosophy 53 (3), 240-255. DOI: https://doi.org/10.1017/can.2024.4",
                "Graf, Simon (2021). The Epistemology of Groups by Jennifer Lackey. [Book Review] Perspectives: International Postgraduate Journal of Philosophy (9), 380-387. LINK: https://philpapers.org/rec/GRARTE-5"
            ],
            "research_interests_text": "My current research focus lies in epistemology, especially the intersection between collective and social epistemology. I am also interested in various related epistemological questions in philosophy of science, philosophy of mind, and decision theory."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.221529"
    },
    {
        "name": "Dr. Ron Aboodi",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/ron-aboodi-baa892e2.html",
        "description": "Personal information Ron Aboodi has joined the MCMP as a Minerva Fellow. Ron is pursuing a research project on Character Education under Normative Uncertainty , drawing on his experience in the areas of moral motivation, decision theory for moral uncertainty, and philosophy of education. Since receiving his PhD in Philosophy from the Hebrew University of Jerusalem, Ron served as a postdoctoral researcher in several universities, among them the University of Toronto (Philosophy Department).",
        "metadata": {
            "position": "Minerva Stiftung Postdoctoral Research Fellow",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/aboodi-ron-foto_1_1_format_s.jpg",
            "email": "Aboodi.Ro@lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "website": "https://sites.google.com/mail.huji.ac.il/ronaboodi/home"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.679975"
    },
    {
        "name": "Luca Castaldo",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/luca-castaldo-8bb4aa67.html",
        "description": "Personal information I obtained my PhD from the University of Bristol and have held postdoctoral positions at the Universities of Warsaw and Florence. Since February 2025, I am an AvH Fellow at the MCMP.\n\nResearch interests My research primarily focuses on formal theories of truth and semantic notions, the interplay between classical and non-classical logics, and paradoxes. I also work on Explainable AI within Human-Computer Interaction and Nonmonotonic Reasoning.\n\nPublications",
        "metadata": {
            "position": "Humboldt fellow",
            "organizational_unit": "MCMP",
            "email": "Luca.Castaldo@lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 221",
            "website": "https://sites.google.com/view/lucacastaldo",
            "research_interests_text": "My research primarily focuses on formal theories of truth and semantic notions, the interplay between classical and non-classical logics, and paradoxes. I also work on Explainable AI within Human-Computer Interaction and Nonmonotonic Reasoning."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.406566"
    },
    {
        "name": "Tyko Schuff, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/tyko-schuff-1a7b0264.html",
        "description": "Personal information I am a doctoral fellow at the MCMP under the supervision of Hannes Leitgeb and Martin Fischer. Before my doctoral studies, I completed Master’s degrees in Logic and in Art History.\n\nResearch interests My work is on logical consequence in non-classical settings and the problem of meaning variance. I’m interested in many related subjects in the philosophy of logic, such as truth, pluralism and logical constants. Apart from that, I’m also interested in aesthetics.",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "MCMP",
            "email": "Tyko-Schuff@live.se",
            "office_address": "Ludwigstr. 31",
            "room": "Room 225",
            "research_interests_text": "My work is on logical consequence in non-classical settings and the problem of meaning variance. I’m interested in many related subjects in the philosophy of logic, such as truth, pluralism and logical constants. Apart from that, I’m also interested in aesthetics."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.562475"
    },
    {
        "name": "Andreas Frenzel",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/andreas-frenzel-2b2ef953.html",
        "description": "PhD project My dissertation project is entitled \"Language and Reasoning: Carnapian Frameworks and the Capabilities of Formal Systems\". It consists of two parts. In the first part, the prelude, I conduct a metatheoretical study of the notion of a formal language. In this part, I will look at several notions relating to metasemantics, conceptual engineering, Carnapian linguistic frameworks, and issues of logic, in order to ascertain what can and cannot be done in a formal language. In the second and main part, I will conduct a series of case studies by explicitly constructing fragments of formal languages, in order to investigate how useful they are for representing and solving various philosophical problems, according to the particular goals that are pursued in each case. My dissertation will result in a clearer understanding of the uses of formal languages for philosophy.\n\nFull CV (PDF, 180 KB)",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/frenzel-andreas-portrait_1_1_format_s.jpg",
            "email": "Andreas.Frenzel@campus.lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 225"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.457990"
    },
    {
        "name": "Dr. Toby C. P. Solomon",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/toby-c-p-solomon-40eb9477.html",
        "description": "Personal information Toby Solomon is currently a postdoctoral fellow at the Munich Center for Mathematical Philosophy at LMU Munich. His position is supported by a grant from the Alexander von Humboldt Foundation. In 2021 he completed his PhD at the Australian National University, with a thesis on the connection between free will and causal decision theory. In addition to a B.A. in philosophy, he holds a B.Sc. in advanced mathematics and physics, both from the University of Sydney.\n\nResearch interests Toby's Alexander von Humboldt Foundation project is entitled \"What can I do?: Modelling Option-Uncertainty in Decision Theory\". As the title suggests, the aim of this project is to develop formal models to understand how rational decision-makers should respond to uncertainty about what their options are (or, in other words, what they can do). He also continues to think about the theme of his PhD research, namely the relationship between traditional problems of free will and decision theory. He defends a view he calls Libertarian Decision Theory: roughly, that rational decision-makers must presuppose that their choices are uncaused and unconstrained by the past and the laws of nature (though they almost certainly should not believe that). More broadly he is interested in carefully characterizing the problems, and their potential solutions, that arise when decision-makers reflect on the causes of their own choices. Some other things he has been thinking about recently include the difficulties that Causal Decision Theory has with dynamic/diachronic decision situations, deflationary truth based solutions to the semantic paradoxes, and self-referential paradoxes in decision theory.",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/solomon-toby_1_1_format_s.jpg",
            "email": "Toby.Solomon@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 033",
            "website": "https://tcpsolomon.com/",
            "selected_publications": [
                "Causal Decision Theory, Two-Boxing, and Deliberation-Compatibilism: A Reply to Sandgren and Williamson . Australasian Journal of Philosophy 100, no. 3 (2022): 620–27.",
                "Causal Decision Theory’s Predetermination Problem . Synthese 198, no. 6 (2021): 5623–54."
            ],
            "research_interests_text": "Toby's Alexander von Humboldt Foundation project is entitled \"What can I do?: Modelling Option-Uncertainty in Decision Theory\". As the title suggests, the aim of this project is to develop formal models to understand how rational decision-makers should respond to uncertainty about what their options are (or, in other words, what they can do). He also continues to think about the theme of his PhD research, namely the relationship between traditional problems of free will and decision theory. He defends a view he calls Libertarian Decision Theory: roughly, that rational decision-makers must presuppose that their choices are uncaused and unconstrained by the past and the laws of nature (though they almost certainly should not believe that). More broadly he is interested in carefully characterizing the problems, and their potential solutions, that arise when decision-makers reflect on the causes of their own choices. Some other things he has been thinking about recently include the difficulties that Causal Decision Theory has with dynamic/diachronic decision situations, deflationary truth based solutions to the semantic paradoxes, and self-referential paradoxes in decision theory."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.678262"
    },
    {
        "name": "Ursula Danninger, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/ursula-danninger-b397784f.html",
        "description": "München Room finder Send an email +49 89 2180-6171 Office hours: By appointment Postal address: Geschwister-Scholl-Platz 1, HP 90 80539\nMünchen up",
        "metadata": {
            "position": "Administration",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "Office.Leitgeb@lrz.uni-muenchen.de",
            "phone": "+49 89 2180-6171",
            "office_address": "Ludwigstraße 31",
            "room": "Room 226"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.170173"
    },
    {
        "name": "Dr. Alexander Blum",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/alexander-blum-b63b404a.html",
        "description": "Personal information I received a PhD in theoretical particle physics from the University of Heidelberg and the Max Planck Institute for Nuclear Physics in 2009. As a postdoc I worked in the project \"History and Foundations of Quantum Physics\" at the Max Planck Institute for History of Science and the Fritz Haber Institute. Most recently (from 2017 to 2025) I was head of the Max Planck Research Group \"Historical Epistemology of the Final Theory Program\" at the Albert Einstein Institute and the Max Planck Institute for the History of Science. I joined the MCMP in February 2025.\n\nResearch interests I’m interested in exploring the foundations of modern physics through its history. My main interest is in quantum field theory, but I have also worked extensively on the renaissance of general relativity, the origins of quantum mechanics, and the history of magnetohydrodynamics. My aim is to better understand how we arrived at the multifarious concepts, theoretical structures, and calculational practices that we use to order the world and to what extent we can view them as contributing to a unified picture.",
        "metadata": {
            "position": "Senior Volkswagen Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "email": "Alexander.Blum@lmu.de",
            "phone": "+49-30-2266-7114",
            "selected_publications": [
                "Blum, Alexander S. (2022): Einstein’s second-biggest blunder: the mistake in the 1936 gravitational-wave manuscript of Albert Einstein and Nathan Rosen . Archive for History of Exact Sciences 76: 623–632.",
                "Blum, Alexander S. & Martin Jähnert (2022): The birth of quantum mechanics from the spirit of radiation theory . Studies in the History and Philosophy of Science 91: 125–147.",
                "Blum, Alexander S. & Stefano Furlan (2022): How John Wheeler lost his faith in the law . In: Yemima Ben-Menahem (ed.). Rethinking the Concept of Laws of Nature: Natural Order in the Light of Contemporary Science (pp. 283–322). Cham: Springer.",
                "Blum, Alexander S. (2021): John Wheeler’s Desert Island: The conservatism of non-empirical physics . Studies in the History and Philosophy of Science 90: 219-225.",
                "Blum, Alexander S. & Dieter Brill (2020): Tokyo Wheeler or the epistemic preconditions of the renaissance of relativity . In: Alexander S. Blum, Roberto Lalli & Jürgen Renn (eds.). The Renaissance of General Relativity in Context (pp. 141–187). Cham: Birkhäuser.",
                "Blum, Alexander S., Roberto Lalli & Jürgen Renn (2018). Gravitational waves and the long relativity revolution . Nature Astronomy 2: 534–543.",
                "Blum, Alexander S. & Dean Rickles (2018). Quantum Gravity in the First Half of the Twentieth Century: A Sourcebook . Berlin: Edition Open Access.",
                "Blum, Alexander S. (2017): The State is not abolished, it withers away: How Quantum Field Theory became a Theory of Scattering . Studies in History and Philosophy of Science B 60: 46-80.",
                "Blum, Alexander S. & Christian Joas (2016): From Dressed Electrons to Quasiparticles: The Emergence of Emergent Entities in Quantum Field Theory . Studies in History and Philosophy of Science B 53: 1-8.",
                "Blum, Alexander S. (2015): QED and the man who didn’t make it: Sidney Dancoff and the infrared divergence . Studies in History and Philosophy of Science B 50: 70-94."
            ],
            "research_interests_text": "I’m interested in exploring the foundations of modern physics through its history. My main interest is in quantum field theory, but I have also worked extensively on the renaissance of general relativity, the origins of quantum mechanics, and the history of magnetohydrodynamics. My aim is to better understand how we arrived at the multifarious concepts, theoretical structures, and calculational practices that we use to order the world and to what extent we can view them as contributing to a unified picture."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.528174"
    },
    {
        "name": "PD Dr. Martin Fischer",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/martin-fischer-76784a68.html",
        "description": "Personal information I studied at and received my PhD from LMU. My first postdoc position was at the KU Leuven in the Formal Epistemology Project. Thereafter I worked at the MCMP in a DFG-project on syntactical treatments of modalities, with Prof. Leitgeb as principal investigator. After a one-year stay at the Scuola Normale Superiore, I carried out my own DFG-funded project on Logical Pluralism, lasting three years, at the MCMP. I have held the position of assistant at the MCMP over several semesters. In July I will start as the PI of the AHRC-DFG funded project: The Mathematical Turn in Philosophy: Measurement, Computation, (De)Idealization.\n\nResearch interests One of my main research interests is truth from the perspective of philosophy of language as well as logic, especially axiomatic theories of truth. I am also interested in modalities. In the area of philosophical logic, I carry out research on questions on logical pluralism. In the philosophy of mathematics, epistemic questions are especially relevant. Besides questions of implicit commitment, I am interested in idealizations taking place in formal treatments and the possibility of avoiding those.",
        "metadata": {
            "position": "Researcher and Lecturer (Privatdozent)",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "M.Fischer1@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 234",
            "selected_publications": [
                "Carlo Nicolai, Martin Fischer, Mario Piazza: A reflection principle for Kripkean truth, Journal of Philosophy (forthcoming).",
                "Fischer, M. & Zicchetti, M.: Definite Totalities and Determinate Truth in Conceptual Structuralism. Synthese , 203(26): (2024).",
                "Fischer, M. & Zicchetti, M.: Internal categoricity, truth and Determinacy. Journal of Philosophical Logic 52(5): 1295-1325 (2023).",
                "Fischer, M. & Nicolai, C. & Dopico, P.: Nonclassical truth with classical strength. A proof-theoretic analysis of compositional truth over HYPE. Review of Symbolic Logic 16 (2): 425-448 (2023).",
                "Fischer, M.: Is the Hype about strength warranted?. Synthese 200(3): 1-25 (2022).",
                "Fischer, M.: Sequent calculi for the propositional logic of HYPE. Studia Logica 110(3): 643-677 (2021).",
                "Fischer, M.: Another look at reflection. Erkenntnis 88(2): 479-509 (2021).",
                "Fischer, M. & Horsten, L. & Nicolai, C.: Hypatia's silence, Truth, justification, and entitlement. Nous 55(1): 62-85 (2021).",
                "Fischer, M. & Gratzl, N.: Truth, Partial Logic and Infinitary Proof Systems. Studia Logica 106(3): 515-540 (2018).",
                "Fischer, M. & Horsten, L. & Nicolai, C.: Iterated Reflection over Full Disquotational Truth. Journal of Logic and Computation 27(8): 2631-2651 (2017).",
                "Fischer, M. & Halbach, V. & Kriener, J. & Stern, J.: Axiomatizing Semantic Theories of Truth. Review of Symbolic Logic 8(2): 257-278 (2015)."
            ],
            "research_interests_text": "One of my main research interests is truth from the perspective of philosophy of language as well as logic, especially axiomatic theories of truth. I am also interested in modalities. In the area of philosophical logic, I carry out research on questions on logical pluralism. In the philosophy of mathematics, epistemic questions are especially relevant. Besides questions of implicit commitment, I am interested in idealizations taking place in formal treatments and the possibility of avoiding those."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.058002"
    },
    {
        "name": "Marta Esteves",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/marta-esteves-a936a6be.html",
        "description": "Personal information I am doctoral fellow at MCMP under the supervision of Hannes Leitgeb and Martin Fischer, since September 2022. Before the start of my doctoral studies, I completed an MA in Philosophy at University of Lisbon, followed by an extended - two year - Logic Year at the ILLC, at the university of Amsterdam, where I focused on the topics Mathematical Logic and Logic and Computation.\n\nResearch interests I am mainly interested in Philosophy of Mathematics and in the application of mathematical methods and results to the solution of philosophical problems. In particular, I am interested in the topic of mathematical structuralism, which my dissertation is about. Here I argue for non-eliminative structuralism, as well as providing an adequate mathematical formulation of structures according to this perspective. More generally, I am also interested in the philosophy of set theory, and formal epistemology (in particular in the application of topological semantics to epistemic logic).",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "Ma.Esteves@campus.lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 223",
            "research_interests_text": "I am mainly interested in Philosophy of Mathematics and in the application of mathematical methods and results to the solution of philosophical problems. In particular, I am interested in the topic of mathematical structuralism, which my dissertation is about. Here I argue for non-eliminative structuralism, as well as providing an adequate mathematical formulation of structures according to this perspective. More generally, I am also interested in the philosophy of set theory, and formal epistemology (in particular in the application of topological semantics to epistemic logic)."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.667362"
    },
    {
        "name": "Elena Rabinoff",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/elena-rabinoff-546dbdc0.html",
        "description": "München up",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "office_address": "Geschwister-Scholl-Platz 1"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.453984"
    },
    {
        "name": "Dr. Levin Hornischer",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/levin-hornischer-a7c95d99.html",
        "description": "Personal information Levin Hornischer is an assistant professor at the Munich Center for Mathematical Philosophy (MCMP). His research and teaching mainly concern the mathematical and philosophical foundations of artificial intelligence, but also neighboring fields such as theoretical computer science, systems theory, mathematical and philosophical logic, the philosophy of language, and epistemology. He obtained his doctorate from the Institute for Logic, Language and Computation (ILLC) of the University of Amsterdam with a project on Foundations of Analogical Thinking , for which he was funded by the Dutch Research Council (NWO).\n\nFull CV (PDF, 128 KB)\n\nResearch interests The main part of my research is on the foundations of artificial intelligence (AI). Modern neural networks and machine learning algorithms have become both impressively and worryingly powerful, but we’re still lacking a general theory for them. Developing such a theory is a fascinating open problem at the intersection of computer science, math, philosophy, cognitive science, and other subjects. For classical computer programs, this largely has been solved: we understand their possibilities, limitations, complexity, semantics, logic, verification, safety, etc. My approach to this problem is to investigate if analogous aspects of understanding can be developed for the sub-symbolic computation of modern AI. I find it fruitful to view this kind of computation as dynamical systems; and in my PhD thesis, I developed a domain-theoretic semantics for them. My research interests outside this topic also include, e.g., the philosophy of language (hyperintensionality, synonymy, vagueness) and philosophical logic (multivalued logics, relevance logic, counterfactuals, non-monotonic logics, logical constants). I enjoy using the tools of dynamical systems theory, domain theory, category theory, duality theory, universal algebra, constructive mathematics, modal logic, and formal epistemology—and especially learning new ones.",
        "metadata": {
            "position": "Assistant Professor",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/levin-hornischer_1_1_format_s.jpg",
            "email": "Levin.Hornischer@lrz.uni-muenchen.de",
            "phone": "+49 89 2180-5473",
            "office_address": "Ludwigstraße 31",
            "room": "Room 123",
            "website": "https://levinhornischer.github.io/",
            "research_interests_text": "The main part of my research is on the foundations of artificial intelligence (AI). Modern neural networks and machine learning algorithms have become both impressively and worryingly powerful, but we’re still lacking a general theory for them. Developing such a theory is a fascinating open problem at the intersection of computer science, math, philosophy, cognitive science, and other subjects. For classical computer programs, this largely has been solved: we understand their possibilities, limitations, complexity, semantics, logic, verification, safety, etc. My approach to this problem is to investigate if analogous aspects of understanding can be developed for the sub-symbolic computation of modern AI. I find it fruitful to view this kind of computation as dynamical systems; and in my PhD thesis, I developed a domain-theoretic semantics for them. My research interests outside this topic also include, e.g., the philosophy of language (hyperintensionality, synonymy, vagueness) and philosophical logic (multivalued logics, relevance logic, counterfactuals, non-monotonic logics, logical constants). I enjoy using the tools of dynamical systems theory, domain theory, category theory, duality theory, universal algebra, constructive mathematics, modal logic, and formal epistemology—and especially learning new ones."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.961844"
    },
    {
        "name": "Leon Assaad",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/leon-assaad-49209189.html",
        "description": "Research interests I am interested in socio-epistemic processes such as the spread of beliefs, communication and collective decision-making. My PhD project analyzes how worrisome social phenomena at the collective level (e.g. belief polarization or echo chambers) can emerge through deliberation between (boundedly) rational agents. To this end, I often work with agent-based simulations, using tools from Bayesian epistemology, game theory and social choice theory.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "email": "Leon.Assaad@googlemail.com",
            "office_address": "Geschwister-Scholl-Platz 1",
            "research_interests_text": "I am interested in socio-epistemic processes such as the spread of beliefs, communication and collective decision-making. My PhD project analyzes how worrisome social phenomena at the collective level (e.g. belief polarization or echo chambers) can emerge through deliberation between (boundedly) rational agents. To this end, I often work with agent-based simulations, using tools from Bayesian epistemology, game theory and social choice theory."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.169786"
    },
    {
        "name": "Prof. Dr. Ulrike Hahn",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/ulrike-hahn-7c94a879.html",
        "description": "Personal information Ulrike Hahn first qualified as a lawyer, passing both her 1st and 2nd State Law Exam in the state of Bavaria, Germany, before taking a Masters in Cognitive Science and Natural Language at the University of Edinburgh. This was followed by a DPhil in Experimental Psychology from Oxford University on the topic of rules and similarity in categorization. On completion of her doctorate, she moved to the Department of Psychology at the University of Warwick as a lecturer, moving on after two years to the School of Psychology at Cardiff University where she remained for 14 years. Since 2012 she has been in the Department of Psychological Sciences at Birkbeck College, University of London, where she also director of the Centre for Cognition Computation and Modelling.\n\nComplete CV (PDF, 180 KB)\n\nResearch interests Ulrike Hahn’s research interests are categorization, similarity, language and language acquisition, and, first and foremost, questions of human rationality. Her research examines human judgment, decision-making, and the rationality of everyday argument. She is presently particularly interested in the role of perceived source reliability on our beliefs, including our beliefs as parts of larger communicative social networks.\n\nFurther activities Ulrike Hahn is presently a member of the Senior Editorial Board of “Topics in Cognitive Science” and an Action Editor for Frontiers in Cognitive Science and for Frontiers in Social Psychology. She also served as an Action Editor for “Psychonomic Bulletin & Review” from 2008-2012, and as a consulting editor for Psychological Review from 2009-2010. She has also served on the programme committee for international conferences, including the Annual Meeting of the Cognitive Science Society, the Conference on Experimental Pragmatics, XPrag 2011. The International Conference on Thinking, ICT 2012, 2015, and the forthcoming 1st European Conference on Argumentation, Lisbon, June 2015.",
        "metadata": {
            "position": "Mercator fellow",
            "organizational_unit": "MCMP",
            "email": "U.Hahn@bbk.ac.uk",
            "office_address": "Geschwister-Scholl-Platz 1",
            "selected_publications": [
                "Zhao, J., Hahn, U., & Osherson, D. (in press). Perception and identification of random events. Journal of Experimental Psychology: Human Perception and Performance.",
                "Maio, G.R., Hahn, U., Frost, J-M., Kuppens, Rehman, T.N., & Kamble, S. (2014) Social Values as Arguments: Similar is Convincing. Frontiers in Psychology.",
                "Hahn, U. (2014) The Bayesian Boom: Good thing or bad? Frontiers in Cognitive Science, Vol. 5, Article 765.",
                "Hahn, U. (2014). Experiential limitation in judgment and decision. Topics in Cognitive Science, 6, 229-244.",
                "Jarvstad, A., Hahn, U.,Warren, P., & Rushton, S., (2014) Are perceptuo-motor decisions really more optimal than cognitive decisions? Cognition, 130, 397-416.",
                "Hahn, U. & Harris, A.J.L. (2014) What does it mean to be biased: rationality and motivated reasoning. The Psychology of Learning and Motivation, Vol. 61, 41-102.",
                "Jarvstad, A., Hahn, U., Rushton, S., & Warren, P. (2013) Perceptuo-motor, cognitive and description-based decisions seem equally good. Proceedings of the National Academy of Science. 110(40), 16271-16276.",
                "Evans, L.E., Maio, G, Corner, A.J, Hodgetts, C. J.,Ahmed, S & Hahn, U. (2013) Self-interest and pro-environmental behavior. Nature Climate Change, 3, 122–125."
            ],
            "research_interests_text": "Ulrike Hahn’s research interests are categorization, similarity, language and language acquisition, and, first and foremost, questions of human rationality. Her research examines human judgment, decision-making, and the rationality of everyday argument. She is presently particularly interested in the role of perceived source reliability on our beliefs, including our beliefs as parts of larger communicative social networks."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.248514"
    },
    {
        "name": "Allie Richards",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/allie-richards-b1857f17.html",
        "description": "",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Science"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.809370"
    },
    {
        "name": "Prof. Dr. Godehard Link, Dipl.Math.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/godehard-link-9cdf6ff9.html",
        "description": "Personal information Studied mathematics and philosophy at LMU Munich, with a focus on mathematical and philosophical logic, physics, logic and philosophy of science, as well as linguistics, funded by the Studienstiftung des deutschen Volkes. Former assistant to Wolfgang Stegmüller. Until 2009, Professor of Logic and Philosophy of Science at LMU Munich. Speaker for the graduate program \"Language, Information, Logic\" (SIL) at LMU. Research projects funded by the DFG and Humboldt Foundation. Research visits at MIT, IBM Deutschland, and Stanford University (multiple times). Served as the Director of the Philosophy department, Vice-Dean, and Dean of Research at LMU, as well as a board member of the Munich Center for Neuroscience - Mind and Brain (MCN) and the Core Faculty of the Graduate School of Systemic Neurosciences (GSN). Co-initiator of the Munich Center for Mathematical Philosophy (MCMP).\n\nCurriculum vitae 1988 - 1989 Visiting researcher, IBM Germany, Stuttgart, at the Institute for Knowledge-Based Systems 1985-86, 1987, 1995-96, 1997 Visiting researcher at the Center for the Study of Language and Information (CSLI), Stanford, USA 1979 - 2009 Professor of Logic and Philosophy of Science at LMU 1978 Dr.phil.habil. Logic and Philosophy of Science, LMU; Habilitation on the foundations of linguistic semantics 1974 - 1979 Assistant Professor ( Wissenschaftlicher Assistent ) with W. Stegmüller, at the Seminar for Philosophy, Logic and Philosophy of Science, LMU 1974 Dr. phil. in Logic and Philosophy of Science, LMU; dissertation on intensional semantics 1972 - 1974 DFG research grant on the foundations of subjective probability 1970 Diploma in mathematics (main fields pure mathematics, mathematical logic, probability theory), LMU View all\n\nAcademic distinctions The Bertrand Russell Society Book Award for editing One Hundred Years of Russell’s Paradox: Mathematics, Logic, Philosophy . McMaster University, Toronto, Canada 2005\n\nResearch interests Logic, philosophical and linguistic semantics, philosophy of mathematics and science, Russell studies.\n\nOther activities Research-related activities 1992 - 2001 Faculty member, and since 1995, speaker of the interdisciplinary DFG Graduate Program \"Language, Information, Logic\" (SIL). 1995 - 1999 PI of the DFG research group \"Ontological reduction in the light of metamathematical methods\" (main researchers: Volker Halbach, Karl-Georg Niebergall). 1997 Organisation of the international workshop \"Concepts of Reduction in Logic and Philosophy\", LMU. 2000 Guest Editor, Erkenntnis vol. 53, Nr. 1-2 (2000). 2001 Organisation of the international conference \"One Hundred Years of Russell’s Paradox\", LMU. 2001 - 2004 PI of the DFG research project (with Prof. M. Folkerts, LMU) \"Geschichte der beweistheoretischen Ordinalzahlanalyse und ihre Implikationen für die Philosophie der Mathematik\" (main researcher: Christian Tapp). 2005 - 2011 German Speaker of the Humboldt TransCoop Research Group (with American partner Prof. M. Detlefsen, University of Notre Dame, USA) on \"Imaginary and Ideal Elements and Limit Concepts in Mathematics: Their Theory, History, and Philosophical Understanding\". Administrational duties 2004 - 2006 Director of the Department of Philosophy etc., LMU. 2004 - 2008 Prodekan, Fakultät für Philosophie, Wissenschaftstheorie und Religionswissenschaft, LMU. 2005 Co-Founder of the research organisation \"Munich Center for Neurosciences - Brain and Mind\" (MCN) as part of the research initiative LMUinnovativ, LMU. 2005 - 2009 Board Member of the MCN, LMU. 2006 - 2009 Faculty Member und Member of the Scientific Board, Graduate School of Systemic Neurosciences (GSN), as part of the German Excellence Initiative. Since 2009 Member of the Kuratorium of the MCN.",
        "metadata": {
            "position": "Professor Emeritus of Logic and Philosophy of Science",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "GLink@lrz.uni-muenchen.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "selected_publications": [
                "Objectivity and Truth in Mathematics: A Sober Non-platonist Perspective. In: S. Centrone et al. (eds.), Mathesis Universalis, Computability and Proof . Cham: Springer 2019, 159-202.",
                "Humean Delusions. In: W. Freitag et al. (eds.), Von Rang und Namen. Philosophical Essays in Honour of Wolfgang Spohn . Münster: mentis 2016, 255-284.",
                "Formal Discourse in Russell: From Metaphysics to Philosophical Logic. In: G. Link (ed.), Formalism and Beyond. On the Nature of Mathematical Discourse . Boston-Berlin: de Gruyter 2014, 119-182.",
                "Collegium Logicum. Logische Grundlagen der Philosophie und der Wissenschaften . 2 Bände. Band 1: Paderborn: mentis 2009; Band 2: Münster: mentis 2014.",
                "Bertrand Russell – The Invention of Mathematical Philosophy. Introduction to: G. Link (ed.), One Hundred Years of Russell’s Paradox. Mathematics, Logic, Philosophy . Berlin: de Gruyter 2004, 1–28.",
                "Algebraic Semantics in Language and Philosophy . Stanford: Center for the Study of Language and Information (CSLI) Publications 1998.",
                "The Logical Analysis of Plurals and Mass Terms: A Lattice-Theoretical Approach. In: R. Bäuerle et al. (eds.), Meaning, Use, and Interpretation of Language . Berlin: de Gruyter 1983, 302-323. Reprinted in preceding item, pp. 11-34; again reprinted in P. Porter and B Partee (eds.), Formal Semantics. The Essential Readings . Oxford: Blackwell 2002, pp. 127-146.",
                "Representation Theorems of the de Finetti Type for (Partially) Symmetric Probability Measures. In: R. Jeffreys (ed.), Studies in Inductive Logic and Probability . Volume II. Berkeley - Los Angeles – London: University of California Press 1980, 207-231.",
                "Montague-Grammatik. Die logischen Grundlagen . München: Fink 1979.",
                "Intensionale Semantik . München: Fink 1976."
            ],
            "research_interests_text": "Logic, philosophical and linguistic semantics, philosophy of mathematics and science, Russell studies."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.985940"
    },
    {
        "name": "Dr. Naftali Weinberger",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/naftali-weinberger-86db4739.html",
        "description": "Personal information Naftali Weinberger is currently a postdoctoral research fellow at the Munich Center for Mathematical Philosophy. He completed his Ph.D. at the University of Wisconsin, Madison in 2015 and has previously done research at the Pittsburgh Center for Philosophy of Science and the Tilburg Center for Logic, Ethics, and Philosophy of Science.\n\nResearch interests Naftali uses recently developed causal modeling methods to address foundational questions concerning causal inference and explanation. He has written about the role of causation in a wide range of sciences including: population genetics, psychometrics, neuroscience, and economics. He currently has an ongoing project regarding causation in complex dynamical systems as well as a separate project on causally modeling discrimination. See this podcast episode for more information on causation and complexity. An overview of his approach to discrimination can be found here .\n\nComplete list of publications (PDF, 87 KB)",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/weinberger-naftali-portrait-2404_1_1_format_s.jpg",
            "email": "naftali.weinberger@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 129",
            "website": "https://sites.google.com/site/naftaliweinberger/",
            "selected_publications": [
                "Weinberger, N., Williams, P. and Woodward, J.: The Worldly Infrastructure of Causation. The British Journal for the Philosophy of Science (im Erscheinen).",
                "Weinberger, N.: The Insufficiency of Statistics for Detecting Racial Discrimination by Police . Philosophy of Science (im Erscheinen).",
                "Weinberger, N. (2023): Signal Manipulation and the Causal Analysis of Racial Discrimination . Ergo.",
                "Weinberger, N. and Allen, C. (2022): Static-Dynamic Hybridity in Dynamical Models of Cognition. Philosophy of Science 89(2), April 2022: 283-301.",
                "Weinberger, N. (2022): Comparing Pearl and Rubin's Causal Modeling Frameworks: A Commentary on Markus (2021) . Economics and Philosophy .",
                "Weinberger, N. (2021): Intervening and Letting Go: On the Adequacy of Equilibrium Causal Models . Erkenntnis.",
                "Weinberger, N. (2020): Near-Decomposability and the Time-Scale Relativity of Causal Representations. Philosophy of Science 87: 841-856.",
                "Weinberger, N. (2019): Path-Specific Effects. The British Journal for the Philosophy of Science 70(1): 53-76.",
                "Weinberger, N. (2018): Faithfulness, Coordination, and Causal Coincidences. Erkenntnis 83(2): 113-133 .",
                "Forster, M., Raskutti, G., Stern, R., and Weinberger, N. (2018): The Frugal Inference of Causal Relations. The British Journal for the Philosophy of Science 69(3): 821-848."
            ],
            "research_interests_text": "Naftali uses recently developed causal modeling methods to address foundational questions concerning causal inference and explanation. He has written about the role of causation in a wide range of sciences including: population genetics, psychometrics, neuroscience, and economics. He currently has an ongoing project regarding causation in complex dynamical systems as well as a separate project on causally modeling discrimination. See this podcast episode for more information on causation and complexity. An overview of his approach to discrimination can be found here ."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.955195"
    },
    {
        "name": "Nicola Bonatti, MPhil",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/nicola-bonatti-59f9c167.html",
        "description": "Personal information I'm Nicola Bonatti, doctoral fellow at the Munich Center for Mathematical Philosophy, where I'm pursuing my PhD under the supervision of Prof. Hannes Leitgeb. I’m also a researcher in the DFG-funded project \"New Perspectives on the Semantics of the Epsilon Calculus\", led by Dr. Norbert Gratzl. Before that, I got my MPhil degree in Philosophy from the University of St. Andrews, which is divided into a taught and research year. Earlier, I was a Philosophy undergrad at the University San Raffaele in Milan.\n\nComplete CV (PDF, 150 KB)\n\nResearch interests My primary research interests lie in logic and the philosophy of mathematics. In my PhD thesis, I explore historical, philosophical, and mathematical aspects of extremal axioms, i.e., principles that impose either minimality or maximality conditions on the admissible models of an axiomatic theory. This research is closely connected to the literature on structuralism in the philosophy of mathematics, including the axiomatic method, implicit definitions, and categoricity. Instead, as part of the DFG project, I’m working on a Kripke-style semantics for a conservative extension of Intuitionistic Free Logic with Hilbert’s epsilon-operator. This line of research is primarily motivated by concerns about choice principles and arbitrariness in non-classical settings.",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/foto-nicola-bonatti_1_1_format_s.jpg",
            "email": "Nicola.Bonatti@campus.lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "website": "https://sites.google.com/view/nicola-bonatti/",
            "selected_publications": [
                "Nicola Bonatti (2025). What are Extremal Axioms?, Philosophia Mathematica. https://doi.org/10.1093/philmat/nkaf020",
                "Nicola Bonatti (2022). A Reassessment of Cantorian Abstraction based on the ε-operator, Synthese 200, 396. https://doi.org/10.1007/s11229-022-03840-6"
            ],
            "research_interests_text": "My primary research interests lie in logic and the philosophy of mathematics. In my PhD thesis, I explore historical, philosophical, and mathematical aspects of extremal axioms, i.e., principles that impose either minimality or maximality conditions on the admissible models of an axiomatic theory. This research is closely connected to the literature on structuralism in the philosophy of mathematics, including the axiomatic method, implicit definitions, and categoricity. Instead, as part of the DFG project, I’m working on a Kripke-style semantics for a conservative extension of Intuitionistic Free Logic with Hilbert’s epsilon-operator. This line of research is primarily motivated by concerns about choice principles and arbitrariness in non-classical settings."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.008261"
    },
    {
        "name": "Junyan Feng, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/junyan-feng-9b245787.html",
        "description": "München Room finder Send an email +49 89 2180 3319 Office hours: By appointment Postal address: Geschwister-Scholl-Platz 1 80539\nMünchen up",
        "metadata": {
            "position": "Secretary",
            "organizational_unit": "Chair of Philosophy of Science",
            "email": "Office.Hartmann@lrz.uni-muenchen.de",
            "phone": "+49 89 2180 3319",
            "office_address": "Ludwigstraße 31",
            "room": "Room 134"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.339377"
    },
    {
        "name": "Dr. Laurie Letertre",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/laurie-letertre-c19ce877.html",
        "description": "Personal information I obtained my PhD in physics at the University of Mons, Belgium, in 2016. I obtained a Master in philosophy of physics at the University of Bristol, and then completed a PhD in philosophy at the Université Grenoble Alpes, France, in 2022. My thesis focused on the metaphysics of causal nonseparability in quantum physics. I was a postdoc at the Czech Academy of Science within the Centre for Formal Epistemology, and a visiting researcher at the Warsaw University of Technology, within the Philosophy of Physics Research Group of Prof. Antonio Vassallo. I recently received a MSCA postdoctoral grant to work within the Munich Center for Mathematical Philosophy on the philosophy of spacetime in quantum gravity, starting from June 2023.\n\nFull CV (PDF, 127 KB)\n\nResearch interests First of all, I am interested in the metaphysical questions related to the interpretations of quantum mechanics and theoretical generalisations thereof, such as the process matrix formalism in which indefinite causal orders can be defined. I study the potential metaphysical implications of indefinite causal orders, as well as their connection with nonlocality. I am also interested in the epistemic questions surrounding operational formalisms for physical theories, and the way these formalisms can be used as an epistemic tool to understand theory change and knowledge acquisition in physics. My present focus is on the status of space and time in quantum physics, from quantum mechanics to quantum gravity.",
        "metadata": {
            "position": "Teaching Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "email": "Laurie.Letertre@gmail.com",
            "office_address": "Ludwigstraße 31",
            "room": "Room 124",
            "selected_publications": [
                "Letertre, L. (2021). ‘The operational framework for quantum theories is both epistemologically and ontologically neutral’. Studies in History and Philosophy of Science Part A , 89, 129-137.",
                "Lam, V., Letertre, L. & Mariani, C. (2022). ‘Quantum Metaphysics and the Foundations of Spacetime’. In: The Foundations of Spacetime Physics: Philosophical Perspectives , Vassallo, A. (Hg.), The Routledge Studies in the Philosophy of Mathematics and Physics. Eingeladener Beitrag.",
                "Letertre, L., (2022). ‘Causal nonseparability and its implications for spatiotemporal relations’, Studies in History and Philosophy of Science , 95, 64-74.",
                "Letertre L., (Im Gutachten, eingeladenes Kapitel), ‘Métaphysique quantique’. In: Sciences & métaphysique , Editions Matériologiques."
            ],
            "research_interests_text": "First of all, I am interested in the metaphysical questions related to the interpretations of quantum mechanics and theoretical generalisations thereof, such as the process matrix formalism in which indefinite causal orders can be defined. I study the potential metaphysical implications of indefinite causal orders, as well as their connection with nonlocality. I am also interested in the epistemic questions surrounding operational formalisms for physical theories, and the way these formalisms can be used as an epistemic tool to understand theory change and knowledge acquisition in physics. My present focus is on the status of space and time in quantum physics, from quantum mechanics to quantum gravity."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.511605"
    },
    {
        "name": "Luis F. Bartolo Alegre, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/luis-f-bartolo-alegre-bcb5d454.html",
        "description": "PhD project 'The Grounds of Non-Classicality' is a doctoral research project funded by a DAAD Research Grant - Doctoral Programmes in Germany. It is being conducted at the Munich Center for Mathematical Philosophy (MCMP) under the supervision of Hannes Leitgeb and Martin Fischer since October 2023. Throughout most of its history, logic has relied on certain ‘classical’ principles, such as the laws of excluded middle, non-contradiction, among others. A late outcome of the formalization of logic that began in the mid-19th century, however, is the mathematical possibility of creating logics (i.e., inference systems) that dispense with several of these principles. My research aims to explore the conditions under which it is justifiable to use a particular inference system over another, taking into account specific purposes or contexts. Thus, I delve into the implications of the existing plurality of logical systems for a unified theory of reason, addressing topics such as the universality of logic, logical pluralism, and logical evidence. Additionally, this research also intersects with several of my other academic interests, including the philosophy of science, the philosophy of mathematics, argumentation theory, and epistemology.\n\nFull CV",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Munich Center for Mathematical Philosophy",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/bartolo-luis-portrait_1_1_format_s.jpg",
            "email": "L.Bartolo@campus.lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "website": "https://lfba.seplo.org"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.870697"
    },
    {
        "name": "David Hofmann",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/david-hofmann-27d7a464.html",
        "description": "Personal information I am a doctoral fellow at the MCMP under the supervision of PD Dr. Martin Fischer and Prof. DDr. Hannes Leitgeb. Before starting my postgraduate studies, I completed my M.A. in Logic and Philosophy of Science at LMU, where my thesis focused on Potentialism in Set Theory. Previously, I earned a B.A. in Philosophy at LMU and spent part of my studies at the University of Tokyo.\n\nResearch interests My primary research focuses on the philosophy of mathematics, particularly Predicativism, and Potentialism in arithmetic and set theory. My dissertation explores their interplay and connection to various schools of constructivism. Additionally, I have strong interests in the metaphysics of Gottfried Leibniz and the philosophical contributions of Kurt Gödel, with a focus on their relevance to the foundational issues in mathematics.",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "MCMP",
            "email": "Hofmann.David@campus.lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 225",
            "research_interests_text": "My primary research focuses on the philosophy of mathematics, particularly Predicativism, and Potentialism in arithmetic and set theory. My dissertation explores their interplay and connection to various schools of constructivism. Additionally, I have strong interests in the metaphysics of Gottfried Leibniz and the philosophical contributions of Kurt Gödel, with a focus on their relevance to the foundational issues in mathematics."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.924537"
    },
    {
        "name": "Dr. Norbert Gratzl",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/norbert-gratzl-65125c8f.html",
        "description": "Personal information Norbert is a research associate at the Munich Center for Mathematical Philosophy (MCMP).\n\nResearch interests Norbert is interested in all things philosophical with a strong formal bias.",
        "metadata": {
            "position": "Akademischer Oberrat (a.L.)",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "Norbert.Gratzl@lrz.uni-muenchen.de",
            "phone": "+49 89 2180-5679",
            "office_address": "Ludwigstraße 31",
            "room": "Room 227",
            "selected_publications": [
                "Pavlović, E., Gratzl, N.: Decidable Fragments of the Quantified Argument Calculus. The Review of Symbolic Logic (forthcoming).",
                "Gratzl, N., Pavlović, E.: Is, Ought, and Cut. Journal of Philosophical Logic 52: 1149-1169 (2023).",
                "Pavlović, E., Gratzl, N.: Neutral Free Logic: Motivation, Proof Theory and Models. Journal of Philosophical Logic 52: 519-554 (2023).",
                "Christoff, Z., Gratzl, N., Roy, O.: Priority Merge and Intersection Modalities. The Review of Symbolic Logic 15: 165-196 (2022).",
                "Pavlović, E., Gratzl, N.: A More Unified Approach to Free Logics. Journal of Philosophical Logic 50: 117-148 (2020)."
            ],
            "research_interests_text": "Norbert is interested in all things philosophical with a strong formal bias."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.025818"
    },
    {
        "name": "Dr. Dr. André W. Carus",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/andre-w-carus-19310d6f.html",
        "description": "CV (PDF, 58 KB)\n\nResearch interests My academic training was originally in history; I was very dissatisfied with that discipline, little suspecting that it could get so much worse in years to come. I was then attracted by economics, and also got very interested in cognitive science. Eventually, when I found myself living in Hyde Park (Chicago), I gave in to the inevitable and enrolled in the philosophy graduate program there, where I encountered (among other teachers) Leonard Linsky, Bill Tait, David Malament, and Howard Stein. Also (among other students) Steve Awodey and Erich Reck. These people dragged my attention off in other directions at first, especially Howard, whose interest in his erstwhile teacher Rudolf Carnap much inspired me. But I am now finally getting around, belatedly, to applying what I learned from all those philosophers of science and mathematics at the University of Chicago to social science — which I’m still convinced we have no idea how to do properly. Though there are individual social scientists, usually quite lonely ones, doing great work in isolated corners, none of the relevant disciplines rewards the kind of study that could actually lead to a cumulative and consistent social science with empirical integrity and sociopolitical relevance. I would like to help articulate what its goals and program might be, if the deeply ingrained incentive distortions could someday be overcome.",
        "metadata": {
            "position": "Visting fellow",
            "organizational_unit": "MCMP",
            "email": "AWCarus@mac.com",
            "website": "http://awcarus.net/",
            "research_interests_text": "My academic training was originally in history; I was very dissatisfied with that discipline, little suspecting that it could get so much worse in years to come. I was then attracted by economics, and also got very interested in cognitive science. Eventually, when I found myself living in Hyde Park (Chicago), I gave in to the inevitable and enrolled in the philosophy graduate program there, where I encountered (among other teachers) Leonard Linsky, Bill Tait, David Malament, and Howard Stein. Also (among other students) Steve Awodey and Erich Reck. These people dragged my attention off in other directions at first, especially Howard, whose interest in his erstwhile teacher Rudolf Carnap much inspired me. But I am now finally getting around, belatedly, to applying what I learned from all those philosophers of science and mathematics at the University of Chicago to social science — which I’m still convinced we have no idea how to do properly. Though there are individual social scientists, usually quite lonely ones, doing great work in isolated corners, none of the relevant disciplines rewards the kind of study that could actually lead to a cumulative and consistent social science with empirical integrity and sociopolitical relevance. I would like to help articulate what its goals and program might be, if the deeply ingrained incentive distortions could someday be overcome."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.729265"
    },
    {
        "name": "Diego García Rincón",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/diego-garcia-rincon-a1e4c6f9.html",
        "description": "PhD project Im my dissertation, I ask one question: how is it possible that everything in the physical world is in constant motion, and that nevertheless some order is maintained? I address this question in a philosophical and historical manner by interpreting two dialogues of Plato, the Theaetetus and the Timaeus . I start with Plato’s critique of Radical Flux in the Theaetetus . I show that, according to Plato, a world in radical flux is inherently indeterminate. Then I examine the metaphysical principles Plato introduces in the cosmology of the Timaeus to account for order in the physical world. I dedicate one chapter to the Receptacle, one to Forms, and one to the Demiurge. I show how each of these metaphysical principles of the physical world help account for the latter's order, even though according to Plato it is in continuous transformation.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "D.Garcia@campus.lmu.de"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.841314"
    },
    {
        "name": "Dr. Edi Pavlović",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/edi-pavlovic-a5e296b5.html",
        "description": "Personal information Edi Pavlovic completed his MA in 2012 and his PhD in 2017 at the Central European University (at that time still located in Budapest), both in Philosophy and both focused on non-standard quantification theory of the quantified argument calculus. He has worked in the project \"Modalities and conditionals: Systematic and historical studies\" with the PI Sara Negri as a Postdoctoral Researcher at the University of Helsinki 2018-2021, investigating logic of agency via the see-to-it-that modalities, as well as epistemic logic, using proof-theoretic methods. In September 2021 he joined the MCMP, where he is primarily focused on investigating the proof-theoretic, as well as philosophical, aspects of free logic in the project Free logics: Variants, unification, and some applications with PI Norbert Gratzl.\n\nFull CV (January 2024) (PDF, 129 KB)\n\nResearch interests Edi's interest lies in logic, and especially in all things proof-theoretic, though he will ocassionally find himself intrigued by the philosphical consequences of his proofs. This has led him to be interested in non-classical theories of quantification, and of late especially free logic, as well as a myriad of modalities whose intended interpretations have philosophical heft, like \"do,\" \"ought,\" \"believe,\" and \"know.\"",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "email": "Edi.Pavlovic@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 122",
            "research_interests_text": "Edi's interest lies in logic, and especially in all things proof-theoretic, though he will ocassionally find himself intrigued by the philosphical consequences of his proofs. This has led him to be interested in non-classical theories of quantification, and of late especially free logic, as well as a myriad of modalities whose intended interpretations have philosophical heft, like \"do,\" \"ought,\" \"believe,\" and \"know.\""
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.113555"
    },
    {
        "name": "Rodrigo Mena González",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/rodrigo-mena-gonzalez-441c9acf.html",
        "description": "Personal information I am a doctoral fellow at MCMP under the supervision of Prof. Hannes Leitgeb and Dr. Martin Fischer since September 2022. I obtained a MA in Philosophy of Science at the Universidad de Santiago de Chile in 2018 and a bachelor’s degree in Law at the University of Chile.\n\nResearch interests My research interests are focused on the relationship between syntactic and semantic approaches to the notion of logical consequence, and how these may be related to the translatability of deductive bases and the underdetermination of logical consequences. Am also interested in algebraic approaches to modal and non-classical logics. As a lawyer, I also work on deontic logic.",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "MCMP",
            "email": "Rod.Mena@campus.lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 223",
            "research_interests_text": "My research interests are focused on the relationship between syntactic and semantic approaches to the notion of logical consequence, and how these may be related to the translatability of deductive bases and the underdetermination of logical consequences. Am also interested in algebraic approaches to modal and non-classical logics. As a lawyer, I also work on deontic logic."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.082472"
    },
    {
        "name": "Ragna Talea Oeynhausen, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/ragna-talea-oeynhausen-47dfce7b.html",
        "description": "Research interests My research focuses on concepts of existence in analytic philosophy. In particular, I am interested in questions of meaning, quantification, and the use of proper names. My project touches on issues of metaphysics, philosophy of language and logic, and is loosely inspired by Wittgensteinian insights. Apart from early analytic philosophy (Frege, Russell and Quine), I also work on Meinong and Kripke (and their reception). More generally, I am interested in Aristotle, Kant and Wittgenstein.",
        "metadata": {
            "position": "Doctoral Fellow, Student Assistant",
            "organizational_unit": "Chair of Logic and Philosophy of Language, Chair of Theoretical Philosophy, MCMP",
            "email": "R.Oeynhausen@campus.lmu.de",
            "office_address": "Ludwigstraße 31",
            "research_interests_text": "My research focuses on concepts of existence in analytic philosophy. In particular, I am interested in questions of meaning, quantification, and the use of proper names. My project touches on issues of metaphysics, philosophy of language and logic, and is loosely inspired by Wittgensteinian insights. Apart from early analytic philosophy (Frege, Russell and Quine), I also work on Meinong and Kripke (and their reception). More generally, I am interested in Aristotle, Kant and Wittgenstein."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.606599"
    },
    {
        "name": "Dr. Timo Freiesleben",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/timo-freiesleben-ed672017.html",
        "description": "Further information I am a postdoctoral fellow in the project From Bias to Knowledge: The Epistemology of Machine Learning , working with group leader Dr. Tom Sterkenburg. Previously, I was a postdoctoral researcher funded by the Carl Zeiss Foundation at the Machine Learning for Science Cluster at the University of Tübingen, collaborating with Dr. Thomas Grote. I completed my PhD at the Graduate School for Systemic Neurosciences under the supervision of Prof. Stephan Hartmann.\n\nResearch interests I am a researcher in the philosophy of machine learning, working in close collaboration with machine learning practice. My work focuses on two main questions: 1. The impact that machine learning (potentially) has on science and its epistemic goals; and 2. The conceptual foundations of machine learning as a scientific discipline. My broader areas of interest include: Epistemology of machine learning (e.g. explainable artificial intelligence, statistical learning theory, causal inference) Philosophy of science (e.g. robustness, scientific representation, predictive Modeling) AI ethics (e.g. algortihmic recourse, algorithmic fairness, performativity)",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/freiesleben_original_1_1_format_s.png",
            "email": "Timo.Freiesleben@gmail.com",
            "office_address": "Ludwigstraße 31",
            "room": "Room 126",
            "selected_publications": [
                "Freiesleben, T., et al. (2024). Scientific inference with interpretable machine learning: Analyzing models to learn about real-world phenomena. Minds and Machines.",
                "Freiesleben, T. & Molnar, C. (2024). Supervised machine learning for science, online-book: https://ml-science-book.com/",
                "Freiesleben, T., & Grote, T. (2023). Beyond generalization: a theory of robustness in machine learning. Synthese.",
                "Freiesleben, T. & König, G. (2023). Dear XAI community, we need to talk! Fundamental misconceptions in current XAI research, World XAI conference."
            ],
            "research_interests_text": "I am a researcher in the philosophy of machine learning, working in close collaboration with machine learning practice. My work focuses on two main questions: 1. The impact that machine learning (potentially) has on science and its epistemic goals; and 2. The conceptual foundations of machine learning as a scientific discipline. My broader areas of interest include: Epistemology of machine learning (e.g. explainable artificial intelligence, statistical learning theory, causal inference) Philosophy of science (e.g. robustness, scientific representation, predictive Modeling) AI ethics (e.g. algortihmic recourse, algorithmic fairness, performativity)"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.342337"
    },
    {
        "name": "Dr. John Dougherty",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/john-dougherty-8d752f2f.html",
        "description": "Personal information John Dougherty is an Assistant Professor at the Chair of Philosophy of Science and the Munich Center for Mathematical Philosophy (MCMP). He was previously a postdoctoral fellow at the MCMP. Before joining the MCMP, he obtained his PhD in Philosophy at the University of California San Diego in 2018. He earned bachelor’s degrees in physics and in the history, philosophy, and social studies of science and medicine from the University of Chicago in 2010.\n\nFull CV (PDF, 134 KB)\n\nResearch interests John’s research is concerned with topics in philosophy of science and philosophy of mathematics. One of his projects addresses conceptual issues in high-energy particle theory. This project is particularly focused on philosophical questions concerning symmetry and representation, and it argues that understanding these questions requires philosophers to revise their notion of “structure”. More recently, John’s research has addressed issues arising in contemporary versions of empiricism in the philosophy of science, with a focus on how they have been influenced by developments in formal semantics and by the work of Wilfrid Sellars.\n\nComplete list of publications (PDF, 85 KB)",
        "metadata": {
            "position": "Assistant Professor",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/dougherty-john_1_1_format_s.jpg",
            "email": "John.Dougherty@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 131",
            "website": "http://www.johnedougherty.com/",
            "selected_publications": [
                "Dougherty, J.: Effective and selective realisms. The British Journal for the Philosophy of Science (forthcoming)",
                "Dougherty, J.: Gauge Theories in Physics. Stanford Encyclopedia of Philosophy (2025)",
                "Dougherty, J.: Wilfrid Sellars and constructive empiricism. HOPOS 14(2):435—478 (2024)",
                "Williams, P. D., Dougherty, J. & Miller, M. E.: Cluster decomposition and two senses of isolability. Philosophy of Physics 2 (2024)",
                "Dougherty, J.: The non-ideal theory of the Aharonov–Bohm effect. Synthese 198(12): 12195–12221 (2021)",
                "Dougherty, J.: I ain’t afraid of no ghost. Studies in History and Philosophy of Science 88: 70–84 (2021)",
                "Dougherty, J.: The hole argument, take n. Foundations of Physics 50(4): 330–347 (2020)",
                "Dougherty, J.: Large gauge transformations and the strong CP problem. Studies in History and Philosophy of Modern Physics 69: 50–66 (2020)",
                "Dougherty, J.: What inductive explanations could not be. Synthese , 195(12): 5473–5483 (2018)",
                "Dougherty, J.: Sameness and separability in gauge theories. Philosophy of Science 84(5): 1189–1201 (2017)"
            ],
            "research_interests_text": "John’s research is concerned with topics in philosophy of science and philosophy of mathematics. One of his projects addresses conceptual issues in high-energy particle theory. This project is particularly focused on philosophical questions concerning symmetry and representation, and it argues that understanding these questions requires philosophers to revise their notion of “structure”. More recently, John’s research has addressed issues arising in contemporary versions of empiricism in the philosophy of science, with a focus on how they have been influenced by developments in formal semantics and by the work of Wilfrid Sellars."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.434105"
    },
    {
        "name": "Ayse Sena Bozdag, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/ayse-sena-bozdag-fca8c6f5.html",
        "description": "Personal information I obtained a M.A. degree in Philosophy from Bogazici University, Istanbul, with a thesis titled “Modelling Belief Revision via Belief Bases”. I joined the MCMP as a Doctoral fellow in 2017 and I am currently working under the supervision of Prof. DDr. Hannes Leitgeb.\n\nResearch interests My main interests are Dynamics of Belief and Knowledge, Dynamic Logics, Paraconsistent Logics and Semantics of Logic. My current studies are focused on Formal Theories of Belief Revision.",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language",
            "email": "Sena.Bozdag@lrz.uni-muenchen.de",
            "office_address": "Ludwigstr. 31",
            "research_interests_text": "My main interests are Dynamics of Belief and Knowledge, Dynamic Logics, Paraconsistent Logics and Semantics of Logic. My current studies are focused on Formal Theories of Belief Revision."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.278249"
    },
    {
        "name": "Killian Francis McGrath, M.Phil, M.Mus.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/killian-francis-mcgrath-2dae488d.html",
        "description": "PhD project My thesis presents a philosophical assessment of modern scientific models of consciousness, exploring the intersections of consciousness science, analytic philosophy of mind, phenomenology, and ontological questions.",
        "metadata": {
            "position": "Doctoral Fellow, Lecturer",
            "organizational_unit": "Chair of Philosophy of Science",
            "email": "Killian.McGrath@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:59.299603"
    },
    {
        "name": "Beinan Li, M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/beinan-li-607660ce.html",
        "description": "Personal information I am currently a doctoral fellow at MCMP, under the supervision of Prof. DDr. Hannes Leitgeb. Prior to this, I obtained two master's degrees in Philosophy from University College London and the University of Amsterdam.\n\nResearch interests My PhD project will explore formalization as a method to study philosophy. I am interested in metaphilosophy, philosophy of language, and the history of 20th-century analytic philosophy.",
        "metadata": {
            "position": "Doctoral fellow",
            "organizational_unit": "MCMP",
            "email": "Beinan.Li@campus.lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "research_interests_text": "My PhD project will explore formalization as a method to study philosophy. I am interested in metaphilosophy, philosophy of language, and the history of 20th-century analytic philosophy."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.754264"
    },
    {
        "name": "Dr. Tom Sterkenburg",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/tom-sterkenburg-ebac616a.html",
        "description": "Personal information Tom Sterkenburg is Emmy Noether junior group leader of the project From Bias to Knowledge: The Epistemology of Machine Learning . This project builds on his earlier German Science Foundation-funded project on The Epistemology of Statistical Learning Theory . Before coming to the MCMP, he did his PhD at the Department of Theoretical Philosophy of the University of Groningen and the Dutch national research center for mathematics and computer science (CWI Amsterdam). His PhD thesis on universal prediction received the Wolfgang Stegmüller Award of the German Society for Analytic Philosophy.\n\nResearch interests Tom’s research is in the philosophy of induction and the epistemological foundations of machine learning. He is in particular interested in applying the mathematical theory of machine learning to philosophical questions around machine learning and artificial intelligence.",
        "metadata": {
            "position": "Emmy Noether Group Leader",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/sterkenburg-tom_1_1_format_s.jpg",
            "email": "Tom.Sterkenburg@lrz.uni-muenchen.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "room": "Room 126",
            "website": "http://tomster.userweb.mwn.de/",
            "selected_publications": [
                "Sterkenburg, T.F.: On explaining the success of induction. The British Journal for the Philosophy of Science (forthcoming).",
                "Stewart, R.T., Sterkenburg, T.F.: Peirce, pedigree, Probability. Transactions of the Charles S. Peirce Society 58(2): 138-166 (2022).",
                "Sterkenburg, T.F.: On characterization of learnability with computable learners. Proceedings of Machine Learning Research 178 ( COLT 2022 ): 3365-3379 (2022).",
                "Sterkenburg, T.F., De Heide, R.: On the truth-convergence of open-minded Bayesianism. The Review of Symbolic Logic 15(1): 64-100 (2022).",
                "Sterkenburg, T.F., Grünwald, P.D.: The no-free-lunch theorems of supervised learning. Synthese 199: 9979-10015 (2021).",
                "Sterkenburg, T.F.: The meta-inductive justification of induction. Episteme 17(4): 519-541 (2020).",
                "Sterkenburg, T.F.: The meta-inductive justification of induction: The pool of strategies. Philosophy of Science 86(5): 981-992 (2019).",
                "Sterkenburg, T.F.: Putnam’s diagonal argument and the impossibility of a universal learning machine. Erkenntnis 84(3): 633-656 (2018).",
                "Sterkenburg, T.F.: A generalized characterization of algorithmic probability. Theory of Computing Systems 61(4): 1337-1352 (2017).",
                "Sterkenburg, T.F.: Solomonoff prediction and Occam’s razor. Philosophy of Science 83(4): 459-479 (2016)."
            ],
            "research_interests_text": "Tom’s research is in the philosophy of induction and the epistemological foundations of machine learning. He is in particular interested in applying the mathematical theory of machine learning to philosophical questions around machine learning and artificial intelligence."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.288498"
    },
    {
        "name": "Dr. Alessandra Marra",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/alessandra-marra-49c2b2b9.html",
        "description": "Personal information Alessandra Marra is an Assistant Professor at the Chair of Logic and Philosophy of Language at the Munich Center for Mathematical Philosophy (MCMP). Before the assistant professorship, she was a postdoc at the MCMP (2019-2021) and a lecturer within the Philosophy and Economics program at Bayreuth University (2017-2019). She defended her PhD thesis \"Deontic Modality in Rationality and Reasoning\" at the Tilburg Center for Logic, Ethics and Philosophy of Science (TiLPS), Tilburg University, in 2019. She holds an MSc in Logic from the Institute for Logic Language and Computation (ILLC) and an MA in Philosophy from the Ca' Foscari University of Venice. She is a proud member of the Steering Committee for the Society of Deontic Logic and Normative Systems .\n\nFull CV (October 2019) (PDF, 123 KB)\n\nResearch interests Alessandra's research interests concern normative reasoning. She approaches the issue from various angles: philosophical logic (logics for obligations, intentions, and plans), metaethics (subjective vs objective oughts, prima facie vs all-things-considered oughts), semantics (deontic modals, indicative conditionals, and the inference rules governing their interaction), and the intersection between philosophy of logic and epistemology (the normative role that logical principles play for the reasoning of bounded agents like ourselves).",
        "metadata": {
            "position": "Assistant Professor",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/marra-alessandra-portrait_1_1_format_s.jpg",
            "email": "Alessandra.Marra@lrz.uni-muenchen.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 234",
            "website": "http://www.alessandramarra.org",
            "selected_publications": [
                "De Benedetto, M., Marra, A. \"Logical norms as defeasible obligations: disentangling sound and feasible inferences.” 2024. Inquiry . online first.",
                "Liu, F., Marra, A., Portner, P., Van De Putte, F. (Eds): \"Norms in Social Perspective: DEON 2020/2021 (Special Issue)\" 2023. Journal of Logic and Computation . Oxford University Press.",
                "Klein, D., Marra, A. “From Oughts To Goals: A Logic for Enkrasia.” 2020. Studia Logica , (108): 85-128.",
                "Marra, A. “Objective Oughts and a Puzzle about Futurity.” 2016. In Roy O., Tamminga A., Willer M. (Eds): Deontic Logic and Normative Systems . College Publications. 171–186.",
                "Marra, A., Klein, D. “Logic and Ethics: An Integrated Model for Norms, Intentions and Actions.” 2015. In Hoek van der W., Holliday W., Wang W. (Eds): Logic, Rationality, and Interaction . Springer. 268-281.",
                "Marra, A. “For a Dynamic Semantics of Necessity Deontic Modals.” 2014. In Cariani F., Grossi D., Meheus J., Parent X. (Eds): Deontic Logic and Normative Systems . Springer. 124-138."
            ],
            "research_interests_text": "Alessandra's research interests concern normative reasoning. She approaches the issue from various angles: philosophical logic (logics for obligations, intentions, and plans), metaethics (subjective vs objective oughts, prima facie vs all-things-considered oughts), semantics (deontic modals, indicative conditionals, and the inference rules governing their interaction), and the intersection between philosophy of logic and epistemology (the normative role that logical principles play for the reasoning of bounded agents like ourselves)."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.329989"
    },
    {
        "name": "PhD Daniele Bruno Garancini",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/daniele-bruno-garancini-c0caa4ad.html",
        "description": "Personal information Daniele is a Humboldt fellow at the MCMP. Previously, he held an Ernst Mach fellowship at the University of Salzburg, which was awarder to him immediately after the completion of his PhD at Lingnan University, Hong Kong. Daniele's interests include sport climbing and cooking.\n\nResearch interests Daniele has an interest in epistemology and philosophy of science. In particular, he has done work on the epistemology of logic and scientific progress in the history of philosophy. Moreover, Daniele recently developed an interest in science policy.",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "MCMP",
            "email": "Garancini.Daniele@lmu.de",
            "office_address": "Ludwigstr. 31",
            "selected_publications": [
                "Experiment-Driven Rationalism Synthese 203(109) (2024).",
                "Fragility and Strength Analysis 84(4):720-729 co-authored with Teodor Călinoiu (2024).",
                "Tautologies and Theorems in the Tractatus Alois Pichler, Friedrich Stadler, and Esther Heinrich-Ramharter (eds.), Proceedings of the 44th International Wittgenstein Symposium. Berlin/Boston: De Gruyter (2024).",
                "The Problem of Philosophical Progress in the First Critique and the Tractatus History of Philosophy and Logical Analysis 27 (2):310-336 (2025).",
                "Progress in Philosophy – A Case for Unconditional Optimism Forthcoming De Gruyter Monograph.",
                "An Approach to Searching for Scientific Progress in Philosophy Synthese (forthcoming)."
            ],
            "research_interests_text": "Daniele has an interest in epistemology and philosophy of science. In particular, he has done work on the epistemology of logic and scientific progress in the history of philosophy. Moreover, Daniele recently developed an interest in science policy."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.508265"
    },
    {
        "name": "Dr. Bianca Scheeff",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/bianca-scheeff-6bbbc016.html",
        "description": "Secretary's e-mail at the Chair of Philosophy and Political Theory (Prof. Dr. Laura Valentini): Office.Valentini@lrz.uni-muenchen.de Secretary's e-mail at the Chair of Philosophy and Decision Theory (Prof. Dr. Christian List): Office.List@lrz.uni-muenchen.de\n\nPersonal information Bianca Scheeff completed her doctorate at the Munich School of Philosophy with a dissertation on the concept of reality in Hegel and Aristotle. Her dissertation, entitled Thought and Reality , was published in May 2025. Since May 2024, she has been managing the offices of Prof. Christian List (Chair of Philosophy and Decision Theory) and Prof. Laura Valentini (Chair of Philosophy and Political Theory).",
        "metadata": {
            "position": "Secretary",
            "organizational_unit": "Chair of Philosophy and Decision Theory",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/scheeff-bianca-portrait_1_1_format_s.jpg",
            "email": "Office.List@lrz.uni-muenchen.de",
            "phone": "+49 89 2180-1807",
            "office_address": "Geschwister-Scholl-Platz 1"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.188006"
    },
    {
        "name": "Katia Parshina, M.Sc.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/katia-parshina-68f163f5.html",
        "description": "Personal information I am a doctoral fellow at the MCMP under the supervision of Tom Sterkenburg. Earlier, I completed the Master of Logic program at ILLC, University of Amsterdam. Before that, I earned a BA in Philosophy from the HSE University, Moscow.\n\nResearch interests My main interests are epistemology of AI, philosophy of science, and philosophy of mathematics, as well as the intersection of these topics. For my PhD project, I focus on the problems surrounding the epistemological analysis of machine learning, particularly the interpretation of inductive bias in ML. In my MSc thesis, I researched the role of mathematical intuition in AI-assisted mathematical proofs.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/mcmp/photos/parshina_katia_original_1_1_format_s.jpg",
            "email": "E.Parshina@lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "research_interests_text": "My main interests are epistemology of AI, philosophy of science, and philosophy of mathematics, as well as the intersection of these topics. For my PhD project, I focus on the problems surrounding the epistemological analysis of machine learning, particularly the interpretation of inductive bias in ML. In my MSc thesis, I researched the role of mathematical intuition in AI-assisted mathematical proofs."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.248076"
    },
    {
        "name": "Dr. Vanessa Carr",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/vanessa-carr-b88cdd54.html",
        "description": "Personal information Vanessa Carr is an Assistant Professor ( Akademische Rätin ) at the Chair of Philosophy and Decision Theory at the Munich Center for Mathematical Philosophy at LMU. She was previously a Junior Fellow at FU Berlin (2020 - 2021) as part of the Human Abilities research group, and a Postdoctoral Fellow at Leipzig University (2018 - 2019). In summer semester 2024, she has a research residency at the Center for Advanced Studies, LMU. Vanessa is also currently a deputy women's representative for the LMU Faculty of Philosophy, Philosophy of Science and Religious Studies. In this capacity, she can be confidentially contacted by students and members of staff about any matter of harassment or discrimination.\n\nResearch interests Her research generally concerns the nature of intentional action, and the distinctive form of control that we have when we act intentionally. Her PhD, and later work building on this research, focused on the role of causation in an account of intentional agency, addressing a wide-range of action-kinds, including the creation and change of abstract artworks. She is now also working on other aspects of intentional agency, such as the relationship between our means and our ends, the knowledge of what we are doing and how to do it, and the rationality of our beliefs about what we intend to do. Other agency-related topics that Vanessa is interested in include practical reason and rationality, willpower, the sense of agency, mental action, collective action, and social practices. More broadly, Vanessa is interested in moral psychology, philosophy of mind, and social philosophy.",
        "metadata": {
            "position": "Assistant Professor",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/carr-vanessa_1_1_format_s.jpg",
            "email": "Vanessa.Carr@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 029",
            "website": "https://vanessancarr.com/",
            "selected_publications": [
                "Carr, V.: Created, Changeable, and Yet Acausal? Proceedings of the Aristotelian Society 119(3): 325-334 (2019).",
                "Carr, V.: Causality, Determination and Necessitation in Free Human Action. Synthese 200(4): 1-28 (2022)."
            ],
            "research_interests_text": "Her research generally concerns the nature of intentional action, and the distinctive form of control that we have when we act intentionally. Her PhD, and later work building on this research, focused on the role of causation in an account of intentional agency, addressing a wide-range of action-kinds, including the creation and change of abstract artworks. She is now also working on other aspects of intentional agency, such as the relationship between our means and our ends, the knowledge of what we are doing and how to do it, and the rationality of our beliefs about what we intend to do. Other agency-related topics that Vanessa is interested in include practical reason and rationality, willpower, the sense of agency, mental action, collective action, and social practices. More broadly, Vanessa is interested in moral psychology, philosophy of mind, and social philosophy."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.316958"
    },
    {
        "name": "Arthur Saraiva",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/arthur-saraiva-b6724d1c.html",
        "description": "Further Information I am a DAAD doctoral fellow at the MCMP, under the supervision of Prof. Stephan Hartmann. Previously, I completed a BA in Physics (2023) and an MA in Philosophy (2025) at the Federal University of Rio de Janeiro, Brazil.\n\nResearch Interests My main research interests lie in Philosophy of Physics, Metaphysics, and Philosophy of Science. In my PhD project, I focus on the classical limit of QM and QFT, especially concerning particle emergence within these theoretical frameworks.",
        "metadata": {
            "position": "DAAD Doctoral Fellow",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/mcmp/downloads/arthur_saraiva_original_1_1_format_s.jpg",
            "email": "Arthur.Saraiva@campus.lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.224760"
    },
    {
        "name": "Dr. Jonas Raab",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/jonas-raab-7d2b477b.html",
        "description": "Personal information Jonas completed a Magister Artium in Philosophy, Mathematics, and Statistics in 2014 with a thesis on Aristotle's Metaphysics and a Master of Arts in Logic and Philosophy of Science in 2017 with a thesis on the relationship of the Quantified Argument Calculus and classical logic; both degrees were obtained at the LMU. Jonas completed a PhD in Philosophy in 2021 with a thesis in metametaphysics at the University of Manchester. From September 2022 until August 2024, Jonas was a Government of Ireland Postdoctoral Fellow at Trinity College Dublin with funding from the Irish Research Council (grant number GOIPD/2022/635), working on a project relating to Explication, Modelling, and Pluralism. Jonas joined the MCMP in September 2024 with his Austrian-German bilateral project Modal Reasoning, Quarc and Metaphysics (MODREQUAM) .\n\nComplete CV (PDF, 95 KB)\n\nResearch interests Jonas has interests in most areas of theoretical philosophy, with special interest in methodological questions. He has published on Aristotelian logic, Quine's account of explication, Easy Ontology, and co-written a companion chapter on metaphysics. For more information, see his website: https://www.jonasraab.org .",
        "metadata": {
            "position": "Postdoctoral fellow",
            "organizational_unit": "MCMP",
            "email": "J.Raab@lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 122",
            "website": "https://www.jonasraab.org/",
            "research_interests_text": "Jonas has interests in most areas of theoretical philosophy, with special interest in methodological questions. He has published on Aristotelian logic, Quine's account of explication, Easy Ontology, and co-written a companion chapter on metaphysics. For more information, see his website: https://www.jonasraab.org ."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:00.229024"
    },
    {
        "name": "Cordelia Berz, M.Sc., M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/cordelia-berz-6c842f82.html",
        "description": "Personal Information I am a doctoral fellow at the Munich Center for Mathematical Philosophy, supervised by Hannes Leitgeb and Alexander Reutlinger. Before starting my PhD, I studied Physics at TU Berlin, at the University of St. Andrews and at TU Munich (M.Sc.). I also hold a B.A. in Philosophy and an M.A. in Logic and Philosophy of Science, both from the MCMP at LMU Munich.\n\nResearch Interests My research focuses on understanding how large language models (LLMs), such as ChatGPT, reason and make inferences. I use a combination of experimental methods and theoretical analysis to study how these systems handle causal and counterfactual reasoning - that is, reasoning about causes and 'what if' situations. I also work in the field of explainable AI (XAI), exploring the logical and semantic foundations of counterfactual explanations, i.e. explanations describing how changing certain factors could alter an algorithm’s decision. Beyond these topics, I am interested in the philosophy of language and game theory.",
        "metadata": {
            "position": "Doctoral Fellow",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/berz-cordelia_1_1_format_s.jpg",
            "email": "C.Berz@campus.lmu.de",
            "office_address": "Ludwigstr. 31",
            "room": "Room 225"
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:02.506599"
    },
    {
        "name": "PD Dr. habil. Jürgen Landes",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/juergen-landes-31111448.html",
        "description": "Personal information I have a background in mathematics (PhD in 2009) and moved to philosophy in 2012. Since then I've earned habilitations in philosophy from LMU Munich (2021) and from the Italian state in philosophy and mathematics (2023). I've been the PI of two DFG-funded projects: the first project was on evidence and Bayesian epistemology, the second project was a research network on inductive logic.\n\nResearch interests I'm interested in uncertain reasoning broadly construed, including but not limited to: inductive logic (pure and objective Bayesian), epistemology, general philosophy of science, causal inference (in medicine and elsewhere), knowledge representation and foundations of AI.",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "email": "Juergen_Landes@yahoo.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 125",
            "website": "https://jlandes.wordpress.com/",
            "selected_publications": [
                "Lorenzo Casini and Jürgen Landes. Confirmation by Robustness Analysis. A Bayesian Account . Erkenntnis , 89: pages 367–409, 2024.",
                "Jürgen Landes, Soroush Rafiee Rad and Jon Williamson. Determining maximal entropy functions for objective Bayesian inductive logic . Journal of Philosophical Logic , 52: pages 555–608, 2023.",
                "Barbara Osimani and Jürgen Landes. Varieties of Error and Varieties of Evidence in Scientific Inference . British Journal for the Philosophy of Science , 74 (1): pages 117–170, 2023.",
                "Jürgen Landes and Jon Williamson. Objective Bayesian Nets for Integrating Consistent Datasets . Journal of Artificial Intelligence Research , 74: pages 393–458, 2022.",
                "Jürgen Landes. The variety of evidence thesis and its independence of degrees of independence . Synthese , 198: pages 10.611–10.641, 2021.",
                "Jürgen Landes, Soroush Rafiee Rad and Jon Williamson. Towards the Entropy-Limit Conjecture . Annals of Pure and Applied Logic , 172, 2021.",
                "Jürgen Landes, Barbara Osimani and Roland Poellinger. Epistemology of Causal Inference in Pharmacology . European Journal for Philosophy of Science , 8: pages 3–49, 2018.",
                "James Hawthorne, Jürgen Landes, Christian Wallmann and Jon Williamson. The Principal Principle implies the Principle of Indifference . British Journal for the Philosophy of Science , 68: pages 123–131, 2017.",
                "Jürgen Landes and Jon Williamson. Objective Bayesianism and the maximum entropy principle . Entropy , 15 (9): pages 3528–3591, 2013.",
                "Jürgen Landes, Jeff B. Paris and Alena Vencovská. A survey of some recent results on Spectrum Exchangeability in Polyadic Inductive Logic . Synthese , 181: pages 19–47, 2011."
            ],
            "research_interests_text": "I'm interested in uncertain reasoning broadly construed, including but not limited to: inductive logic (pure and objective Bayesian), epistemology, general philosophy of science, causal inference (in medicine and elsewhere), knowledge representation and foundations of AI."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:57.181572"
    },
    {
        "name": "Dr. David Colaco",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/david-colaco-e59b1b65.html",
        "description": "Personal information David Colaço is a postdoctoral fellow at LMU Munich. He received his PhD from the Department of History and Philosophy of Science at the University of Pittsburgh. He also received graduate certification from the Center for the Neural Basis of Cognition. He received his BA in Philosophy from Rutgers University.\n\nFull CV (PDF, 202 KB)\n\nResearch interests David works at the intersection of history and philosophy of science, philosophy of cognitive science, and philosophy of neuroscience. He is currently working on the DFG project Three Methodological Problems in Memory Science (Project Number 528370787). This project addresses the philosophical dimensions of current controversies in memory science, which links the psychology of memory to its physical basis. Memory science is in an exciting state of flux, resulting from a series of provocative studies and setbacks in the dominant paradigm. The primary objective of this project is to resolve three related problems that contribute to this state of flux. First, what phenomena can be demonstrated? This is the demonstration problem . Second, where can the physical basis of memory be located? This is the localization problem . Third, by what set of criteria can memory be distinguished from non-memory? This is the demarcation problem . Together, these heretofore unresolved problems suggest that memory might depart from intuitive, scientific, and philosophical notions. With this, these problems challenge widely accepted commitments and paradigmatic success stories in cognitive science and neuroscience, as scientific study of the mind and brain long has been directed by insights about memory. At their cores, these problems are manifestations of topics in philosophy of science. They each concern a dimension of how the targets of scientific investigation are determined. For this reason, the proposed project adopts the stance that traction on resolving these problems and therefore settling these controversies can be made by philosophically analyzing memory science and its current state of flux. However, this project will do more than only settle existing controversies in memory science. These outcomes will also supply new insights into classic problems in philosophy of science. Further, these insights will have a firm basis in the realities of the scientific practice, its history, and its future. These insights will serve as a basis for informing naturalistic philosophical accounts that appeal to memory, including in epistemology, personal identity, and ethics. David is also interested in scientific reasoning. He focuses on cases in which these forms of reasoning might be flawed, and he explores the epistemic and ethical ramifications of potentially flawed reasoning. In his research, he integrates cognitive science research on biases, philosophical models of scientific reasoning, and analyses of cases from the history of science.\n\nComplete list of publications (PDF, 115 KB)",
        "metadata": {
            "position": "Postdoctoral researcher",
            "organizational_unit": "Chair of Philosophy of Science, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/colaco-photo_1_1_format_s.jpg",
            "email": "David.Colaco@lmu.de",
            "office_address": "Ludwigstraße 31",
            "room": "Room 129",
            "website": "https://sites.google.com/site/colacodavidj/",
            "selected_publications": [
                "Colaço, D. & Najenson, J.: Where memory resides: is there a rivalry between synaptic and molecular models of memory? Philosophy of Science (forthcoming).",
                "Colaço, D.: When remediating one artifact results in another: Control, confounders, and correction. History and Philosophy of the Life Sciences 46 (5) (2024) .",
                "Colaço, D.: Connecting unconventional cognition to humans: Unification and generativity. JoLMA 4 (2): 1-16 (2023).",
                "Colaço, D. & Robins, S.: Why have “revolutionary” tools found purchase in memory science? Philosophy and the Mind Sciences, 4: (2023).",
                "Colaço, D.: Why studying plant cognition is valuable, even if plants aren’t cognitive. Synthese 200 (453): (2022).",
                "Colaço, D., Bickle, J. & Walters, B.: When should researchers cite study differences in response to a failure to replicate? Biology and Philosophy 39(37): (2022).",
                "Colaço, D.: What counts as a memory? Definitions, hypotheses, and “kinding in progress”. Philosophy of Science 89(1): 89-106 (2022).",
                "Colaço, D.: Recharacterizing scientific phenomena. European Journal for Philosophy of Science 10, 14: (2020).",
                "Colaço, D.: Rip it up and start again: The rejection of a characterization of a phenomenon. Studies in History and Philosophy of Science 72: 32-40 (2018).",
                "Colaço, D.: Rethinking the role of theory in exploratory experimentation. Biology and Philosophy 33(5-6): 33-38 (2018)."
            ],
            "research_interests_text": "David works at the intersection of history and philosophy of science, philosophy of cognitive science, and philosophy of neuroscience. He is currently working on the DFG project Three Methodological Problems in Memory Science (Project Number 528370787). This project addresses the philosophical dimensions of current controversies in memory science, which links the psychology of memory to its physical basis. Memory science is in an exciting state of flux, resulting from a series of provocative studies and setbacks in the dominant paradigm. The primary objective of this project is to resolve three related problems that contribute to this state of flux. First, what phenomena can be demonstrated? This is the demonstration problem . Second, where can the physical basis of memory be located? This is the localization problem . Third, by what set of criteria can memory be distinguished from non-memory? This is the demarcation problem . Together, these heretofore unresolved problems suggest that memory might depart from intuitive, scientific, and philosophical notions. With this, these problems challenge widely accepted commitments and paradigmatic success stories in cognitive science and neuroscience, as scientific study of the mind and brain long has been directed by insights about memory. At their cores, these problems are manifestations of topics in philosophy of science. They each concern a dimension of how the targets of scientific investigation are determined. For this reason, the proposed project adopts the stance that traction on resolving these problems and therefore settling these controversies can be made by philosophically analyzing memory science and its current state of flux. However, this project will do more than only settle existing controversies in memory science. These outcomes will also supply new insights into classic problems in philosophy of science. Further, these insights will have a firm basis in the realities of the scientific practice, its history, and its future. These insights will serve as a basis for informing naturalistic philosophical accounts that appeal to memory, including in epistemology, personal identity, and ethics. David is also interested in scientific reasoning. He focuses on cases in which these forms of reasoning might be flawed, and he explores the epistemic and ethical ramifications of potentially flawed reasoning. In his research, he integrates cognitive science research on biases, philosophical models of scientific reasoning, and analyses of cases from the history of science."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:46:58.003704"
    },
    {
        "name": "Dr. Mario Günther",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/mario-guenther-81cd14c5.html",
        "description": "Personal information Mario Günther is an Assistant Professor ( akademischer Rat ) at the Munich Center for Mathematical Philosophy of LMU Munich. Previously, he worked at the Australian National University and visited the London School of Economics and Political Science. He was a Junior Researcher in Residence at the Center for Advanced Studies in winter term 2023/24. He received the 2022 Wolfgang Stegmüller Award for the paper “Learning Conditional Information by Jeffrey Imaging on Stalnaker Conditionals” published in the Journal of Philosophical Logic in 2018.\n\nFull CV (PDF, 81 KB)\n\nResearch interests Mario Günther's research centers on applying logical and mathematical tools to philosophical problems in epistemology, metaphysics, and the philosophies of science, language, law, and artificial intelligence. Currently, he is principal investigator of a research project on legal proof funded by the Junior Research Fund of LMU Munich.",
        "metadata": {
            "position": "Assistant professor",
            "organizational_unit": "Chair of Philosophy and Decision Theory, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/guenther-mario_1_1_format_s.jpg",
            "email": "Mario.Guenther@lmu.de",
            "phone": "+49 16 3729-9541",
            "office_address": "Ludwigstraße 31",
            "room": "Room 033",
            "website": "https://www.mario-guenther.com/",
            "selected_publications": [
                "(forthc.) Actual Causation (with Holger Andreas), dialectica",
                "(2024) A Regularity Theory of Causation (with Holger Andreas), Pacific Philosophical Quarterly 105(1): 2-32.",
                "(2023) Counterfactuals for Causal Responsibility in Legal Contexts (with Holger Andreas and Matthias Armgardt), Artificial Intelligence and Law 31(1): 115-132.",
                "(2022) Causal and Evidential Conditionals, Minds and Machines 32(4): 613-626.",
                "(2022) Algorithmic and Human Decision Making: For a Double Standard of Transparency (with Atoosa Kasirzadeh), AI & Society 37(1): 375-381",
                "(2021) Regularity and Inferential Theories of Causation (with Holger Andreas), The Stanford Encyclopedia of Philosophy",
                "(2021) Difference-Making Causation (with Holger Andreas), Journal of Philosophy 118(12): 680-701.",
                "(2021) A Ramsey Test Analysis of Causation for Causal Models (with Holger Andreas), British Journal for the Philosophy of Science 72(2): 587-615.",
                "(2020) Causation in Terms of Production (with Holger Andreas), Philosophical Studies 177(6): 1565-1591.",
                "(2019) On the Ramsey Test Analysis of ‘Because” (with Holger Andreas) Erkenntnis 84(6): 1229-1262."
            ],
            "research_interests_text": "Mario Günther's research centers on applying logical and mathematical tools to philosophical problems in epistemology, metaphysics, and the philosophies of science, language, law, and artificial intelligence. Currently, he is principal investigator of a research project on legal proof funded by the Junior Research Fund of LMU Munich."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.581999"
    },
    {
        "name": "Hannah Pillin, M.Sc., M.A.",
        "url": "https://www.philosophie.lmu.de/mcmp/en/people/contact-page/hannah-pillin-c89e2fdd.html",
        "description": "Personal information I am a PhD student in Logic and Philosophy of Science at the Munich Center for Mathematical Philosophy (MCMP) at LMU Munich, supervised by Hannes Leitgeb and Christian List. I am also the administrative assistant of the Mentoring Programm of Faculty 10 of LMU.\n\nPhD project My PhD project is in epistemology, where I work on fragmentation of doxastic attitudes, such as belief and justification. Fragmentation is the idea that an agent's doxastic state can be made up of multiple different fragments that might be inconsistent with each other. This is opposed to more traditional accounts, where a doxastic state has to be one big consistent \"bubble\". My dissertation is titled „Fragmented Justification\". For more information, please refer to my website .\n\nResearch interests Besides epistemology, I am also interested in (doxastic) logic, philosophy of logic, specifically in questions about normativity of logic and rationality, social epistemology (judgment aggregation, social choice), philosophy of language, and philosophy of science. In philosophy of science, I am especially interested in the epistemology of complex system sciences, such as climate sciences, as well as the role values play in science. Related to this interest, in 2022, I have pursued a 5-month Blue Book traineeship at the European Commission, Directorate General CLIMA, where I worked on climate change, climate modeling and climate policy.\n\nPublications Hannah Pillin (2025). Fragmented justification (Synthese 206, 135, link.springer.com/article/10.1007/s11229-025-05193-2 )",
        "metadata": {
            "position": "Doctoral fellow, student assistant",
            "organizational_unit": "Chair of Logic and Philosophy of Language, MCMP",
            "image_url": "https://cms-cdn.lmu.de/media/10-philosophie/fakultaetswebsite-philosophie/photos/personen/pillin-hannah_1_1_format_s.jpg",
            "email": "Hannah.Pillin@campus.lmu.de",
            "office_address": "Geschwister-Scholl-Platz 1",
            "website": "https://hannahpillin.weebly.com/",
            "research_interests_text": "Besides epistemology, I am also interested in (doxastic) logic, philosophy of logic, specifically in questions about normativity of logic and rationality, social epistemology (judgment aggregation, social choice), philosophy of language, and philosophy of science. In philosophy of science, I am especially interested in the epistemology of complex system sciences, such as climate sciences, as well as the role values play in science. Related to this interest, in 2022, I have pursued a 5-month Blue Book traineeship at the European Commission, Directorate General CLIMA, where I worked on climate change, climate modeling and climate policy."
        },
        "type": "person",
        "scraped_at": "2026-02-07T17:47:01.116356"
    }
]