[
    {
        "title": "Research Seminar in Decision and Action Theory: Irrational option exclusion?",
        "url": "https://www.philosophie.lmu.de/mcmp/en/latest-news/events-overview/event/research-seminar-in-decision-and-action-theory-irrational-option-exclusion.html",
        "scraped_at": "2026-01-28T08:55:59.382692",
        "description": "28\nJan\nResearch Seminar in Decision and Action Theory: Irrational option exclusion?\nDate:\nWed:\n10:00 am\n- 12:00 pm\n28 January 2026\nLocation:\nLudwigstr. 31 Ground floor, room 021\n80539 München\nAbstract\nPractical deliberation can be thought of as consisting of two stages: we think about our options and then (if all goes well) choose the option we consider best. Failures of practical rationality are typically associated with the second stage. In this talk, I consider whether the first stage – thinking of our options – falls within the scope of rational evaluation. Recently, some have argued that agents may be practically irrational for excluding particular options from consideration when these options are especially well-aligned with their values and reasons (Jeppsson, 2018). Others argue that, since option generation is spontaneous and sub-personal, the only rationally evaluable aspect at this stage is how long an agent spends thinking about their options (Wedgwood, 2017). I canvass a third possibility: the process of thinking about our options is structured by the exercise of attentional capacities and competence. This suggests that the normativity of attention is importantly intertwined with the normativity of practical rationality.\nSpeakers\nSophie Kikkert\n(MCMP)\nPlease note\nStart at 10:00 a.m.!",
        "metadata": {
            "wed": "10:00 am\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t- 12:00 pm"
        }
    },
    {
        "title": "Talk: Carl Hoefer (Barcelona)",
        "url": "https://www.philosophie.lmu.de/mcmp/en/latest-news/events-overview/event/talk-carl-hoefer-barcelona.html",
        "scraped_at": "2026-01-28T08:55:59.382729",
        "description": "28\nJan\nTalk: Carl Hoefer (Barcelona)\nDate:\nWed:\n4:00 pm\n28 January 2026\nLocation:\nLudwigstr. 31\nGround floor, room 021\n80539 München\nTitle:\nNatural kinds, laws, and necessities: lessons from post-Twin-Earth science and philosophy\nAbstract:\nIn a paper co-authored by Genoveva Martí, we defended the Kripke-Putnam thesis that water is necessarily composed of H2O molecules, i.e., that there is no world in which the substance we call ‘water’ exists but is not composed mostly of H2O molecules. But we agree with Putnam that it can be hard to know what to say about imagined possible worlds in which the physical (and hence chemical) laws are different in certain ways. In this talk I will explore some of the speculative ways in which physicists investigate what would be the case in such counternomic worlds, and how these speculations interact with the nature of water and other natural kinds, as well as with powers, dispositions, and other denizens of philosophy-folk physics and chemistry. I will use these explorations to motivate some lessons for debates about the modal status of laws and physical natural",
        "metadata": {
            "wed": "4:00 pm"
        }
    },
    {
        "title": "Talk (Work in Progress): Mario Hubert (LMU)",
        "url": "https://www.philosophie.lmu.de/mcmp/en/latest-news/events-overview/event/talk-work-in-progress-mario-hubert-lmu.html",
        "scraped_at": "2026-01-28T08:55:59.382739",
        "description": "29\nJan\nTalk (Work in Progress): Mario Hubert (LMU)\nDate:\nThu:\n12:00 pm\n29 January 2026\nLocation:\nLudwigstr. 31\nGround floor, room 021\n80539 München\nTitle:\nCredence without Probability\nAbstract:\nI develop the Typicality Principle of Expectations (TPE), a novel rationality principle that links typicality-based probabilistic explanations with expectations about the future. I argue that TPE offers a more coherent foundation in the context of typicality-based probabilistic explanations for expectations than traditional rationality principles, including Cournot's Principle, Locke's Principle of Proportionality and Lewis's Principal Principle. The framework of the TPE will ultimately reject a fundamental assumption about probability, namely, its Janus-faced dual nature, as representing objective chance and credences. Thus, I advocate a monistic account of probability: probabilities reflect purely statistical patterns and do not directly map to credences.",
        "metadata": {
            "thu": "12:00 pm"
        }
    }
]