[
    {
        "id": "logic",
        "name": "Logic and Philosophy of Language",
        "description": "Research area focusing on Logic and Philosophy of Language",
        "subtopics": [],
        "projects": [],
        "url": "https://www.philosophie.lmu.de/mcmp/en/research/index.html"
    },
    {
        "id": "philsc",
        "name": "Philosophy of Science",
        "description": "Research area focusing on Philosophy of Science",
        "subtopics": [],
        "projects": [],
        "url": "https://www.philosophie.lmu.de/mcmp/en/research/index.html"
    },
    {
        "id": "decision",
        "name": "Decision Theory",
        "description": "Research area focusing on Decision Theory",
        "subtopics": [],
        "projects": [],
        "url": "https://www.philosophie.lmu.de/mcmp/en/research/index.html"
    },
    {
        "id": "structure",
        "name": "Mathematical Philosophy",
        "description": "Research area focusing on Mathematical Philosophy",
        "subtopics": [
            "Research",
            "Philosophy of machine learning at the MCMP"
        ],
        "projects": [
            {
                "title": "Research",
                "description": "You are in the following website hierarchy: Home You are here: Research Research The Munich Center for Mathematical Philosophy (MCMP) is dedicated to advancing philosophy through the systematic use of mathematical and formal methods. Our research spans logic, epistemology, philosophy of science, philosophy of physics, decision and social choice theory, and the philosophy of language, mathematics, and artificial intelligence. Across these domains, we share a commitment to clarity, rigor, and the productive interaction between philosophy and adjacent scientific disciplines. Enlarge Skip to content Our research profile From Bias to Knowledge: The Epistemology of Machine Learning The Scale Revolution in Physics Amalgamating Evidence About Causes: Medicine, the Medical Sciences, and Beyond Causal Extrapolation in Theory and Practice Three Methodological Problems in Memory Science Fundamental Indeterminacy of Spacetime Deep Learning in Particle Physics Character Education Under Normative Uncertainty Show more Our research profile The MCMP brings together three research groups: Logic and Language (led by Hannes Leitgeb), Philosophy of Science (led by Stephan Hartmann), and Philosophy and Decision Theory (led by Christian List). Together, these groups foster a unique environment in which diverse methodological approaches converge—ranging from logic, probability theory, and formal semantics to Bayesian networks, game theory, and computational modeling. Current research projects address fundamental questions such as: How should we understand rational belief and reasoning under uncertainty? What constitutes scientific explanation and understanding? How can models and simulations contribute to knowledge? What are the conceptual foundations of physics and the philosophy of AI? And how can decision and social choice theory illuminate individual and collective agency, responsibility, and democratic processes? The MCMP also serves as an international hub for the exchange of ideas. We regularly host workshops, conferences, and lecture series that bring leading scholars and promising early-career researchers to Munich. Through these activities, and through our specialized Master's program in Logic and Philosophy of Science, we provide a stimulating environment for graduate training and interdisciplinary collaboration. By combining mathematical precision with philosophical depth, the MCMP demonstrates how formal methods can shed light on some of the most profound and pressing questions in philosophy and beyond. Our Publications From Bias to Knowledge: The Epistemology of Machine Learning From Bias to Knowledge: The Epistemology of Machine Learning (2023 - 2029) Read more Funded by: DFG Emmy Noether Programme Project duration: 2023 - 2029 People: Dr. Tom Sterkenburg (Project leader) Chair: Chair of Philosophy of Science Project page The Scale Revolution in Physics The Scale Revolution in Physics (2024 - 2027) Read more Funded by: Initiative: Pioniervorhaben Exploration der VolkswagenStiftung Project duration: 2024 - 2027 People: Dr. Sébastien Rivat (Project leader) Chair: Chair of Philosophy of Science Project page Amalgamating Evidence About Causes: Medicine, the Medical Sciences, and Beyond Amalgamating Evidence About Causes: Medicine, the Medical Sciences, and Beyond (2023 - 2026) Read more Funded by: Arts and Humanities Research Council (AHRC, United Kingdom) und DFG (“UK-German Collaborative Research Project in the Arts and Humanities”) Project duration: 2023 - 2026 People: Prof. Dr. Stephan Hartmann and Prof. Dr. Jacob Stegenga (Cambridge) Chair: Chair of Philosophy of Science Project page Causal Extrapolation in Theory and Practice Causal Extrapolation in Theory and Practice (2023 - 2026) Read more Funded by: DFG Project duration: 2023 - 2026 People: Dr. Naftali Weinberger (Project leader) Chair: Chair of Philosophy of Science Project page Three Methodological Problems in Memory Science Three Methodological Problems in Memory Science (2023 - 2025) Read more Funded by: DFG Project duration: 2023 - 2025 People: Dr. David Colaco (Project leader) Chair: Chair of Philosophy of Science Project page Fundamental Indeterminacy of Spacetime Fundamental Indeterminacy of Spacetime (2023 - 2025) Read more Funded by: HORIZON TMA MSCA Postdoctoral Fellowship Project duration: 2023 - 2025 People: Dr. Laurie Letertre (Project leader) Chair: Chair of Philosophy of Science Project page Deep Learning in Particle Physics Enlarge © Jan Greune / LMU Funded by: DFG Project duration: 2022 - 2025 People: Dr. Martin King Chair: Chair of Philosophy of Science Project page Character Education Under Normative Uncertainty Character Education Under Normative Uncertainty Read more Funded by: Minerva Stiftung Project duration: - People: Ron Aboodi Chair: Chair of Philosophy and Decision Theory Project page up Share To share copy Link Share on Facebook Share on X Share on LinkedIn",
                "url": "https://www.philosophie.lmu.de/mcmp/en/research/",
                "type": "research_project",
                "scraped_at": "2026-02-14T13:26:45.732841"
            },
            {
                "title": "Philosophy of machine learning at the MCMP",
                "description": "You are in the following website hierarchy: Home Research You are here: Philosophy of Machine Learning Philosophy of machine learning at the MCMP We investigate machine learning and artificial intelligence in the tradition of scientific philosophy embodied by the MCMP. Skip to content People Activities Teaching Selected publications Focus Our research centers on epistemological questions in machine learning. We are particularly interested in the reliability and interpretability of machine learning systems, as well as their role in scientific reasoning. To address these topics, we draw on the rich philosophical traditions of explanation, induction, and scientific modeling. Approach We take a formal and interdisciplinary approach. Our work engages with the mathematical foundations of machine learning, incorporates computational methods, and applies tools from formal epistemology to explore foundational questions. Consequently, collaboration is central to our research—we work closely with scientists, especially machine learning researchers. We are actively involved in several research initiatives, including the Munich Center for Machine Learning (MCML) , the Konrad Zuse School of Excellence in Reliable AI (relAI) , and the AI-HUB@LMU . Teaching We offer a unique range of advanced Master's-level courses that combine philosophical depth with technical rigor. These include seminars on the philosophy of statistics, the philosophy of natural language processing, and the mathematical foundations of machine learning ( See below for a list of our regular course offerings ). Our goal is to equip students with both the conceptual and technical tools necessary to critically engage with the field. People Timo Freiesleben is a postdoc in Tom Sterkenburg's Emmy Noether group. His research addresses central topics in the philosophy of machine learning, including explainable AI, robustness, and the epistemic role of machine learning in science. His current work investigates benchmarking as a dominant epistemology in machine learning. Levin Hornischer is assistant professor at the Chair of Logic and Philosophy of Language. He is working on the mathematical and philosophical foundations of artificial intelligence. For example, he (a) used programming semantics to describe the behavior of neural networks, (b) he used the axiomatic theory of social choice to analyze how neural networks aggregate preferences, and (c) he used the language of reasons as an interpretability method of neural networks. Luis Lopez is a postdoctoral fellow at the Chair of Philosophy of Science. He works on philosophical questions concerning machine learning models in scientific research, with a focus on the representational capacities of these models and their implications for scientific understanding. Ignacio Ojea Quintana is assistant professor with the Chair of Philosophy of Science. His work focuses on modeling social processes using multi-agent reinforcement learning and data analysis. He also uses natural language processing and network science techniques to study online behavior. His current research focuses on how social media and artificial agents transform social norms. Katia Parshina is a doctoral fellow in Tom Sterkenburg's Emmy Noether group. Her research is centered around epistemology of machine learning, focusing on different philosophical approaches to bias. Her current project focuses on clarifying the definition and function of inductive bias in machine learning, given modern approaches to bias in philosophy. Tom Sterkenburg leads the Emmy Noether junior research group \"From Bias to Knowledge: The Epistemology of Machine Learning.\" He works on the application of the mathematical theory of machine learning to philosophical questions about inductive inference. The Emmy Noether project is concerned with clarifying the notion of inductive bias. Associated members Thomas Grote (UT Nuremberg) Sara Jensen (Oslo) Silvia Milano (TU Munich) Joachim Stein (Tübingen) Visitors Max Hellrigel-Holderbaum (FAU Erlangen, Jan-Feb 2026) Maria Frederica Norelli (Northeastern London, Nov-Dec 2025) Conny Knieling (Pittsburgh, July 2025) Heather Champion (Western/Tübingen, May-Jun 2025) Daniel Herrmann (Groningen, Nov-Dec 2024) Activities Reading group We meet every couple of weeks to discuss a (recent) paper in the philosophy of machine learning, with a focus on epistemological themes. The meetings are in hybrid format. Find more information here . Events Interdisciplinary Workshop on Preferences in Artificial Intelligence (November 2025) Formal Epistemology Meets Philosophy of AI (July 2025) Epistemology and Theory of Machine Learning II (May 2025) Machine Learning meets Mathematical Philosophy (June 2023) Epistemology and Theory of Machine Learning I (March 2023) Teaching The following are courses we provide on a regular basis. To find out what is on offer in the current or upcoming semester, use the course catalogue (you can search by course title or inst",
                "url": "https://www.philosophie.lmu.de/mcmp/en/research/philosophy-of-machine-learning/",
                "type": "research_project",
                "scraped_at": "2026-02-14T13:26:45.918356"
            }
        ],
        "url": "https://www.philosophie.lmu.de/mcmp/en/research/index.html"
    }
]